{
    "args": {
        "crawl_threads": true,
        "forum_items_per_page": 50,
        "num_pages": 1,
        "start_url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewforum.php?f=219"
    },
    "threads": [
        {
            "answers": "1",
            "date": "30. Mär 2017 15:20",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Hallo,<br/>die Gruppe IDB (Identifikation und Biometrie) sucht einen Studenten/Studentin für das Master/Bachelorarbeitsthema \"Food Recognition\".<br/>Der Schwerpunkt der Arbeit liegt im Bereich Computer-Vision.<br/><br/>Eine detaillierte Beschreibung finden Sie hier:<br/><a class=\"postlink\" href=\"https://cloud.igd.fraunhofer.de/owncloud/s/09yFMPSsQj80VWG\">https://cloud.igd.fraunhofer.de/owncloud/s/09yFMPSsQj80VWG</a><br/><br/>Kontakt:<br/>Fraunhofer IGD<br/>Abteilung Smart Living &amp; Biometric Technologies<br/>Fraunhoferstr. 5<br/>64283 Darmstadt<br/><br/>Herr Dirk Siegmund<br/>Tel.: 06151/155-541\t<br/><!-- e --><a href=\"mailto:dirk.siegmund@igd.fraunhofer.de\">dirk.siegmund@igd.fraunhofer.de</a><!-- e --></div>",
                    "body_text": "Hallo,die Gruppe IDB (Identifikation und Biometrie) sucht einen Studenten/Studentin für das Master/Bachelorarbeitsthema \"Food Recognition\".Der Schwerpunkt der Arbeit liegt im Bereich Computer-Vision.Eine detaillierte Beschreibung finden Sie hier:https://cloud.igd.fraunhofer.de/owncloud/s/09yFMPSsQj80VWGKontakt:Fraunhofer IGDAbteilung Smart Living & Biometric TechnologiesFraunhoferstr. 564283 DarmstadtHerr Dirk SiegmundTel.: 06151/155-541\tdirk.siegmund@igd.fraunhofer.de",
                    "date": "Beitragvon Dirk Siegmund » 17. Mär 2017 12:39",
                    "user": "Dirk Siegmund"
                },
                {
                    "body_html": "<div class=\"content\">I'm</div>",
                    "body_text": "I'm",
                    "date": "Beitragvon as54caza » 30. Mär 2017 15:20",
                    "user": "as54caza"
                }
            ],
            "title": "Master's Thesis: Vision-based Food Recognition",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35825&sid=761560cc62e3c239d97418da17f17765",
            "views": "182"
        },
        {
            "answers": "1",
            "date": "30. Mär 2017 15:15",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Videostreaming verursacht den Großteil des Datenverkehrs im heutigen Internet und weist eine weiter steigende Tendenz auf. Aus diesem Grund beschäftigen sich zahlreiche wissenschaftliche Arbeiten mit der Optimierung von Video-on-Demand (VoD)-Systemen sowie der Charakterisierung von Nutzern. <br/>Es besteht jedoch ein Mangel an öffentlich zugänglichen Datensätzen, Modellen sowie einer Beschreibung von aktuellem Nutzerverhalten. Aus diesem Grund soll in dieser Arbeit ein Datensatz untersucht und beschrieben werden. Dazu sollen geeignete statistische Verfahren angewandt werden. Neben der Charakterisierung des Datensatzes, sollen auch Modelle vorgeschlagen und auf ihre Güte hin untersucht werden. <br/><br/>Teil der Arbeit ist es einen Überblick über verwandte, bereits existierende Arbeiten zu geben und Unterschiede im Nutzerverhalten mittels Vergleich gegenüber den bereitgestellten, aktuellen Daten darzustellen. Dazu sollen die Python-Bibliotheken Pandas und Seaborn genutzt werden.<br/><br/>Der bereitgestellte Datensatz wurde im Rahmen einer Nutzerstudie an der TU Darmstadt gesammelt. Dazu haben sich die Teilnehmer eine Android-App (<!-- m --><a class=\"postlink\" href=\"https://play.google.com/store/apps/details?id=de.tudarmstadt.ps.mobilesocialprefetcher\">https://play.google.com/store/apps/deta ... prefetcher</a><!-- m -->) installiert, welche Batteriestatus, Nutzeraktivität, Art der Netzverbindung sowie geschaute YouTube-Videos in anonymisierter Form aufgezeichnet hat. Darüber hinaus sind Metadaten wie Titel, Beschreibung, Upload-Datum und Kanal auf dem die Videos hochgeladen wurden verfügbar. <br/><br/>Bei Fragen zur Ausschreibung oder für ein persönliches Gespräch stehe ich gern zur Verfügung. <br/><br/>Christian Koch, M.Sc., M.Sc.<br/><!-- e --><a href=\"mailto:ckoch@kom.tu-darmstadt.de\">ckoch@kom.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Videostreaming verursacht den Großteil des Datenverkehrs im heutigen Internet und weist eine weiter steigende Tendenz auf. Aus diesem Grund beschäftigen sich zahlreiche wissenschaftliche Arbeiten mit der Optimierung von Video-on-Demand (VoD)-Systemen sowie der Charakterisierung von Nutzern. Es besteht jedoch ein Mangel an öffentlich zugänglichen Datensätzen, Modellen sowie einer Beschreibung von aktuellem Nutzerverhalten. Aus diesem Grund soll in dieser Arbeit ein Datensatz untersucht und beschrieben werden. Dazu sollen geeignete statistische Verfahren angewandt werden. Neben der Charakterisierung des Datensatzes, sollen auch Modelle vorgeschlagen und auf ihre Güte hin untersucht werden. Teil der Arbeit ist es einen Überblick über verwandte, bereits existierende Arbeiten zu geben und Unterschiede im Nutzerverhalten mittels Vergleich gegenüber den bereitgestellten, aktuellen Daten darzustellen. Dazu sollen die Python-Bibliotheken Pandas und Seaborn genutzt werden.Der bereitgestellte Datensatz wurde im Rahmen einer Nutzerstudie an der TU Darmstadt gesammelt. Dazu haben sich die Teilnehmer eine Android-App (https://play.google.com/store/apps/deta ... prefetcher) installiert, welche Batteriestatus, Nutzeraktivität, Art der Netzverbindung sowie geschaute YouTube-Videos in anonymisierter Form aufgezeichnet hat. Darüber hinaus sind Metadaten wie Titel, Beschreibung, Upload-Datum und Kanal auf dem die Videos hochgeladen wurden verfügbar. Bei Fragen zur Ausschreibung oder für ein persönliches Gespräch stehe ich gern zur Verfügung. Christian Koch, M.Sc., M.Sc.ckoch@kom.tu-darmstadt.de",
                    "date": "Beitragvon ckoch » 20. Mär 2017 16:15",
                    "user": "ckoch"
                },
                {
                    "body_html": "<div class=\"content\">I'm</div>",
                    "body_text": "I'm",
                    "date": "Beitragvon as54caza » 30. Mär 2017 15:15",
                    "user": "as54caza"
                }
            ],
            "title": "BA: Studie zur Analyse von YouTube- und Smartphone-Nutzerdaten",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35834&sid=761560cc62e3c239d97418da17f17765",
            "views": "213"
        },
        {
            "answers": "1",
            "date": "30. Mär 2017 15:12",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Musik zählt zu den beliebtesten Multimedia-Inhalten welche über das Internet übertragen werden. Dienste wie Google Music oder Spotify bieten Flatrate-Tarife an und verursachen sie einen großen Teil der Datenlast im Internet. Beispielsweise kommen Spotify und Pandora Radio zusammen auf ca. 4,5% des Downstream-Datenverkehrs in Nord Amerika [1]. Gleichzeitig ist YouTube für ca. 21,2% des Downstream-Datenverkehrs verantwortlich. Das ist deswegen erwähnenswert, da ca. 30% der YouTube-Videos Musikvideos sind [2,3]. Das bedeutet, dass YouTube ungefähr 7x so viel Datenverkehr wie Spotify verursacht wobei sich die Hälfte aller Anfragen auf YouTube an Musikvideos richtet.<br/><br/>Diese Abschlussarbeit beschäftigt sich mit dem Thema Musikstreaming innerhalb YouTubes. Im Rahmen der Arbeit sollen die Popularität von Musikvideos auf YouTube im Vergleich zur globalen Popularität untersucht werden, sowie Popularitäsverläufe beschrieben werden. Zu diesem Zweck wird ein großer Datensatz, welcher Anfragen von Nutzern an YouTube beinhaltet bereitgestellt. In einem nächsten Schritt sollen Methoden des Maschinellen Lernens, z.B. Klassifikationen eingesetzt werden, um Charakteristika wie Genre, Stimmung und Artist zu bestimmen sowie z.B. mittels Regression Popularitäsverläufe vorherzusagen. Solche Mechanismen sollen im Anschluss an ihre Eignung für das Vorladen von Musiktiteln auf Caches innerhalb des Internets oder aber mobile Anwendungen wie z.B. die YouTube Android App untersucht werden. Es ist nicht erforderlich eine App zu entwickeln. <br/><br/>Der Umfang der Arbeit kann abhängig davon, ob es sich um eine Bachelor-, Master-, oder Studienarbeit handelt angepasst und konkretisiert werden.<br/><br/><span style=\"text-decoration: underline\">Quellen</span><br/>[1] Sandvine, “Global Internet Phenomena, Latin America &amp; North America, 2015<br/>[2] Gill et al., “YouTube Traffic Characterization: A View From the Edge”, ACM SIGCOMM, 2007<br/>[3] Cheng et al., “Statistics and Social Network of YouTube Videos”, ACM/IEEE IWQoS, 2008<br/>[4] <!-- m --><a class=\"postlink\" href=\"https://www.youtube.com/yt/press/statistics.html\">https://www.youtube.com/yt/press/statistics.html</a><!-- m --><br/><br/>Christian Koch, M.Sc., M.Sc.<br/><!-- e --><a href=\"mailto:ckoch@kom.tu-darmstadt.de\">ckoch@kom.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Musik zählt zu den beliebtesten Multimedia-Inhalten welche über das Internet übertragen werden. Dienste wie Google Music oder Spotify bieten Flatrate-Tarife an und verursachen sie einen großen Teil der Datenlast im Internet. Beispielsweise kommen Spotify und Pandora Radio zusammen auf ca. 4,5% des Downstream-Datenverkehrs in Nord Amerika [1]. Gleichzeitig ist YouTube für ca. 21,2% des Downstream-Datenverkehrs verantwortlich. Das ist deswegen erwähnenswert, da ca. 30% der YouTube-Videos Musikvideos sind [2,3]. Das bedeutet, dass YouTube ungefähr 7x so viel Datenverkehr wie Spotify verursacht wobei sich die Hälfte aller Anfragen auf YouTube an Musikvideos richtet.Diese Abschlussarbeit beschäftigt sich mit dem Thema Musikstreaming innerhalb YouTubes. Im Rahmen der Arbeit sollen die Popularität von Musikvideos auf YouTube im Vergleich zur globalen Popularität untersucht werden, sowie Popularitäsverläufe beschrieben werden. Zu diesem Zweck wird ein großer Datensatz, welcher Anfragen von Nutzern an YouTube beinhaltet bereitgestellt. In einem nächsten Schritt sollen Methoden des Maschinellen Lernens, z.B. Klassifikationen eingesetzt werden, um Charakteristika wie Genre, Stimmung und Artist zu bestimmen sowie z.B. mittels Regression Popularitäsverläufe vorherzusagen. Solche Mechanismen sollen im Anschluss an ihre Eignung für das Vorladen von Musiktiteln auf Caches innerhalb des Internets oder aber mobile Anwendungen wie z.B. die YouTube Android App untersucht werden. Es ist nicht erforderlich eine App zu entwickeln. Der Umfang der Arbeit kann abhängig davon, ob es sich um eine Bachelor-, Master-, oder Studienarbeit handelt angepasst und konkretisiert werden.Quellen[1] Sandvine, “Global Internet Phenomena, Latin America & North America, 2015[2] Gill et al., “YouTube Traffic Characterization: A View From the Edge”, ACM SIGCOMM, 2007[3] Cheng et al., “Statistics and Social Network of YouTube Videos”, ACM/IEEE IWQoS, 2008[4] https://www.youtube.com/yt/press/statistics.htmlChristian Koch, M.Sc., M.Sc.ckoch@kom.tu-darmstadt.de",
                    "date": "Beitragvon ckoch » 20. Mär 2017 16:18",
                    "user": "ckoch"
                },
                {
                    "body_html": "<div class=\"content\">I'm</div>",
                    "body_text": "I'm",
                    "date": "Beitragvon as54caza » 30. Mär 2017 15:12",
                    "user": "as54caza"
                }
            ],
            "title": "BA/MA: Untersuchung von Nutzerpräferenzen für Musik -Genre, Stimmung und Interpret",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35836&sid=761560cc62e3c239d97418da17f17765",
            "views": "244"
        },
        {
            "answers": "0",
            "date": "20. Mär 2017 16:22",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Für Videostreaming-Plattformen wie YouTube, Dailymotion und Vine sind soziale Netzwerke wie Facebook eine wichtige Quelle von Nutzerzugriffen geworden. Content Delivery Networks (CDNs) wie Akamai oder Google Global Cache unterstützen die Verbreitung von Inhalten, wie auch Videos. Da ein Großteil der Videos eine gewisse räumliche (z.B. Land) und zeitliche (z.B. Tag des Uploads) Lokalität bezüglich ihrer Popularität aufweisen, können Caches dazu beitragen die Netzauslastung von ISPs (z.B. Deutsche Telekom) zu verringern und die Videoquellen durch ein global verteiltes Netz von Caches zu entlasten. Darüber hinaus wird die Verzögerung die der Endkunde erlebt verringert, da der Cache vergleichsweise nah am Nutzer platziert wird. <br/>Der bekannteste Cache-Management-Algorithmus ist LRU. Darüber hinaus gibt es einige Erweiterungen, die z.B. Statistiken zur Cache-Performanzsteigerung (d.h. höhere Cache-Hit-Rate) führen. Andere Arbeiten beschäftigen sich mit proaktiven Verfahren speziell im Kontext des zukünftigen zellulären Netzwerks (5G) [2]. Eine weitere Informationsquelle, deren Nutzbarkeit untersucht wurde sind Soziale Netze [3]. Dabei ist zu bemerken, dass intelligentere Caching-Strategien als LRU nicht zwangsläufig zu einer höheren Performanz führen, z.B. performt LRU in Flash-Crowd-Situationen sehr gut, solang die Größe des Caches entsprechend groß ist. In Situationen in denen eine Vielzahl von kleineren Caches verteilt vorliegt performt LRU allerdings suboptimal. <br/>Im Rahmen dieser Bachelor-/ Masterarbeit soll eine Literaturrecherche durchgeführt werden, welche die aktuellen Forschungsrichtungen der Caching-Verfahren beschreibt und entsprechende Arbeiten einordnet. Basierend darauf soll mit Hilfe eines großen Datensetz an mobilen YouTube-Anfragen ein spezifischer Cache-Ansatz für YouTube entwickelt werden. Das so entwickelte Konzept soll anschließend implementiert und ausgewertet werden. <br/><br/>Der Umfang der Arbeit kann abhängig davon, ob es sich um eine Bachelor-, Master-, oder Studienarbeit handelt angepasst und konkretisiert werden. Bei Rückfragen zur Aufgabenstellung stehe ich gern für ein persönliches Gespräch zur Verfügung. <br/><br/><span style=\"text-decoration: underline\">Quellen</span><br/>[1] G. Hasslinger et al., “Evaluation of Caching Strategies Based on Access Statistics of Past Requests”, LNCS 2014<br/>[2] E. Bastug et al., “Living on the Edge: The Role of Proactive Caching in 5G Wireless Networks”, IEEE Communications <br/>     Magazin, 2014<br/>[3] A. Ruhela et al., “The Scope for Online Social Network Aided Caching in Web CDNs”, Architectures for Networking and <br/>     Communications Systems, 2013<br/><br/>Christian Koch, M.Sc., M.Sc.<br/><!-- e --><a href=\"mailto:ckoch@kom.tu-darmstadt.de\">ckoch@kom.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Für Videostreaming-Plattformen wie YouTube, Dailymotion und Vine sind soziale Netzwerke wie Facebook eine wichtige Quelle von Nutzerzugriffen geworden. Content Delivery Networks (CDNs) wie Akamai oder Google Global Cache unterstützen die Verbreitung von Inhalten, wie auch Videos. Da ein Großteil der Videos eine gewisse räumliche (z.B. Land) und zeitliche (z.B. Tag des Uploads) Lokalität bezüglich ihrer Popularität aufweisen, können Caches dazu beitragen die Netzauslastung von ISPs (z.B. Deutsche Telekom) zu verringern und die Videoquellen durch ein global verteiltes Netz von Caches zu entlasten. Darüber hinaus wird die Verzögerung die der Endkunde erlebt verringert, da der Cache vergleichsweise nah am Nutzer platziert wird. Der bekannteste Cache-Management-Algorithmus ist LRU. Darüber hinaus gibt es einige Erweiterungen, die z.B. Statistiken zur Cache-Performanzsteigerung (d.h. höhere Cache-Hit-Rate) führen. Andere Arbeiten beschäftigen sich mit proaktiven Verfahren speziell im Kontext des zukünftigen zellulären Netzwerks (5G) [2]. Eine weitere Informationsquelle, deren Nutzbarkeit untersucht wurde sind Soziale Netze [3]. Dabei ist zu bemerken, dass intelligentere Caching-Strategien als LRU nicht zwangsläufig zu einer höheren Performanz führen, z.B. performt LRU in Flash-Crowd-Situationen sehr gut, solang die Größe des Caches entsprechend groß ist. In Situationen in denen eine Vielzahl von kleineren Caches verteilt vorliegt performt LRU allerdings suboptimal. Im Rahmen dieser Bachelor-/ Masterarbeit soll eine Literaturrecherche durchgeführt werden, welche die aktuellen Forschungsrichtungen der Caching-Verfahren beschreibt und entsprechende Arbeiten einordnet. Basierend darauf soll mit Hilfe eines großen Datensetz an mobilen YouTube-Anfragen ein spezifischer Cache-Ansatz für YouTube entwickelt werden. Das so entwickelte Konzept soll anschließend implementiert und ausgewertet werden. Der Umfang der Arbeit kann abhängig davon, ob es sich um eine Bachelor-, Master-, oder Studienarbeit handelt angepasst und konkretisiert werden. Bei Rückfragen zur Aufgabenstellung stehe ich gern für ein persönliches Gespräch zur Verfügung. Quellen[1] G. Hasslinger et al., “Evaluation of Caching Strategies Based on Access Statistics of Past Requests”, LNCS 2014[2] E. Bastug et al., “Living on the Edge: The Role of Proactive Caching in 5G Wireless Networks”, IEEE Communications      Magazin, 2014[3] A. Ruhela et al., “The Scope for Online Social Network Aided Caching in Web CDNs”, Architectures for Networking and      Communications Systems, 2013Christian Koch, M.Sc., M.Sc.ckoch@kom.tu-darmstadt.de",
                    "date": "Beitragvon ckoch » 20. Mär 2017 16:22",
                    "user": "ckoch"
                }
            ],
            "title": "BA: Entwicklung eines Prädiktiven Cache-Ansatzes für YouTube",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35838&sid=761560cc62e3c239d97418da17f17765",
            "views": "219"
        },
        {
            "answers": "0",
            "date": "20. Mär 2017 16:19",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Für das schnelle und kostengünstige Übertragen von Multimediainhalten spielen Netzwerk-Caches eine wichtige Rolle. Anstatt z.B. ein YouTube-Video aus den USA zu übertragen, wird auf einen Cache (bzw. Edge Server) zugegriffen, der sich in der Nähe des Nutzers befindet. Das spart zum einen Übertragungszeit und verringert somit die Wartezeit des Nutzers. Zum anderen werden weniger Netzkapazitäten in Anspruch genommen und dadurch weniger Transitkosten, d.h. Kosten die durch Weiterleitung von Datenverkehr über ein anderes Netz entstehen erzeugt. Die Zuordnung von Anfragen und Cache der sie beantwortet ist in der Realität komplex und orientiert sich nicht nur an der Nähe sondern bspw. auch an der Auslastung einzelner Caches. <br/><br/>In dieser Abschlussarbeit soll ein Konzept entwickelt werden, dass sowohl auf Caches gespeicherte Inhalte an Endnutzer weiterleiten als auch auf den Netzwerk-Caches platzieren kann. Die Nutzung soll dabei durch geeignetes Routen optimiert werden. Bspw. Würde eine Anfrage nach einem Video, das aus mehreren Segmenten besteht mit diesem System über einen Pfad geleitet werden, der möglichst viele Videosegmente in den auf dem Pfad liegenden Caches enthält.  Dazu wird ein Szenario mit mehreren Caches sowie eines programmierbaren Netzes, z.B. eines Software-defined Networks (SDNs) in vereinfachter Form angenommen. Dabei hat ein SDN-Controller globales Wissen über die Anfragen sowie Inhalte auf den Caches und kann das Routing entsprechend positiv beeinflussen. Dabei müssen allerdings auch Auslastung und die Zeit in der eine Anfrage beantwortet werden muss betrachtet werden. <br/>Ein weiterer Aspekt des zu entwickelnden Systems ist, dass die Caches eine Anfrage nicht nur reaktiv beantworten können, sondern darüber hinaus proaktiv weitere Inhalte an den Client schicken können, z.B. Video-Segment B, sofern gerade Video-Segment A angefragt wurde. Durch dieses Push-basierte Verfahren können Lastspitzen im Gesamtdatenaufkommen geglättet werden, da prinzipiell die Entscheidungsmöglichkeit besteht Segment B direkt Push-basiert auszuliefern oder später auszuliefern sobald der Videoplayer des Nutzers es anfragt, er also das Video entsprechend weit geschaut hat. <br/><br/>Für weitere Fragen zur Arbeit oder für ein persönliches Gespräch stehe ich gern zur Verfügung. <br/><br/>Christian Koch, M.Sc., M.Sc.<br/><!-- e --><a href=\"mailto:ckoch@kom.tu-darmstadt.de\">ckoch@kom.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Für das schnelle und kostengünstige Übertragen von Multimediainhalten spielen Netzwerk-Caches eine wichtige Rolle. Anstatt z.B. ein YouTube-Video aus den USA zu übertragen, wird auf einen Cache (bzw. Edge Server) zugegriffen, der sich in der Nähe des Nutzers befindet. Das spart zum einen Übertragungszeit und verringert somit die Wartezeit des Nutzers. Zum anderen werden weniger Netzkapazitäten in Anspruch genommen und dadurch weniger Transitkosten, d.h. Kosten die durch Weiterleitung von Datenverkehr über ein anderes Netz entstehen erzeugt. Die Zuordnung von Anfragen und Cache der sie beantwortet ist in der Realität komplex und orientiert sich nicht nur an der Nähe sondern bspw. auch an der Auslastung einzelner Caches. In dieser Abschlussarbeit soll ein Konzept entwickelt werden, dass sowohl auf Caches gespeicherte Inhalte an Endnutzer weiterleiten als auch auf den Netzwerk-Caches platzieren kann. Die Nutzung soll dabei durch geeignetes Routen optimiert werden. Bspw. Würde eine Anfrage nach einem Video, das aus mehreren Segmenten besteht mit diesem System über einen Pfad geleitet werden, der möglichst viele Videosegmente in den auf dem Pfad liegenden Caches enthält.  Dazu wird ein Szenario mit mehreren Caches sowie eines programmierbaren Netzes, z.B. eines Software-defined Networks (SDNs) in vereinfachter Form angenommen. Dabei hat ein SDN-Controller globales Wissen über die Anfragen sowie Inhalte auf den Caches und kann das Routing entsprechend positiv beeinflussen. Dabei müssen allerdings auch Auslastung und die Zeit in der eine Anfrage beantwortet werden muss betrachtet werden. Ein weiterer Aspekt des zu entwickelnden Systems ist, dass die Caches eine Anfrage nicht nur reaktiv beantworten können, sondern darüber hinaus proaktiv weitere Inhalte an den Client schicken können, z.B. Video-Segment B, sofern gerade Video-Segment A angefragt wurde. Durch dieses Push-basierte Verfahren können Lastspitzen im Gesamtdatenaufkommen geglättet werden, da prinzipiell die Entscheidungsmöglichkeit besteht Segment B direkt Push-basiert auszuliefern oder später auszuliefern sobald der Videoplayer des Nutzers es anfragt, er also das Video entsprechend weit geschaut hat. Für weitere Fragen zur Arbeit oder für ein persönliches Gespräch stehe ich gern zur Verfügung. Christian Koch, M.Sc., M.Sc.ckoch@kom.tu-darmstadt.de",
                    "date": "Beitragvon ckoch » 20. Mär 2017 16:19",
                    "user": "ckoch"
                }
            ],
            "title": "MA: Optimiertes Routing zur Ausnutzung von verteilten Caches im zukünftigen Internet",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35837&sid=761560cc62e3c239d97418da17f17765",
            "views": "201"
        },
        {
            "answers": "0",
            "date": "20. Mär 2017 16:16",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Multicast und Caching von Inhalten sind beides Techniken zur Verringerung des Datenaufkommens im Internet. Im Fall von Multicast, werden gleiche Inhalte an eine Gruppe von Nutzern ausgeliefert, welche diese Inhalte entweder unmittelbar (Videostreaming) oder in naher Zukunft (Betriebssystem-Updates) benötigen. Caches hingegen sind abstrakt betrachtet Speicher innerhalb des Netzes, z.B. an einer Funkantenne oder einem Server, welche Anfragen an einen entfernten Inhalt direkt beantworten können, ohne die Anfrage an die oftmals weit entfernte Quelle weiterzuleiten. Das gelingt allerdings nicht in allen Fällen, sondern nur dann, wenn der Inhalt sich bereits im Cache befindet. Das kann entweder durch eine vorrangegangene Nutzeranfrage geschehen sein oder aber proaktiv ausgelöst werden. Eine Möglichkeit diese Inhalte proaktiv an Caches zu übertragen kann eine Multicast-Lösung sein, bei der mehrere Caches den gleichen Inhalt ausgeliefert bekommen, um ihn zu speichern. Das macht vor allem Sinn, wenn gleiche Anfragen an die verschiedenen Caches zu erwarten sind. Beispielsweise platziert Netflix Serien und Filme proaktiv in ihren Caches (innerhalb ihres CDNs OpenConnect).<br/>In dieser Arbeit soll das Zusammenspiel von Multicast und Caching untersucht werden sowie verschiedene Einsatzszenarien entworfen werden. Ein Szenario wurde oben bereits genannt: Das ausliefern von populären Inhalten an mehrere Caches gleichzeitig. Ein weiteres Szenario kann das Cachen an Mobilfunkantennen sein während die Auslieferung zu mehreren Smartphones z.B. über Multicast realisiert werden kann. Hierfür gibt es bereits technische Hilfsmittel wie den Multimedia Broadcast Multicast Service (MBMS). Abschließend soll das Einsparungspotential der im Rahmend er Arbeit entwickelten Ansätze untersucht und evaluiert werden. <br/><br/><span style=\"text-decoration: underline\">Einstiegsliteratur</span><br/>[1] Hao Feng, Zhiyong Chen and Hui Liu, “Minimizing Bandwidth Requirements for VoD Services with Client Caching”, in IEEE GLOCOM, 2016<br/>[2] Piotr Srebrny, Thomas Plagemann, Vera Goebel and Andreas Mauthe, “CacheCast: Eliminating redundant link traffic for single source multiple destination transfers”, in IEEE ICDCS 2010<br/><br/>Christian Koch, M.Sc., M.Sc.<br/><!-- e --><a href=\"mailto:ckoch@kom.tu-darmstadt.de\">ckoch@kom.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Multicast und Caching von Inhalten sind beides Techniken zur Verringerung des Datenaufkommens im Internet. Im Fall von Multicast, werden gleiche Inhalte an eine Gruppe von Nutzern ausgeliefert, welche diese Inhalte entweder unmittelbar (Videostreaming) oder in naher Zukunft (Betriebssystem-Updates) benötigen. Caches hingegen sind abstrakt betrachtet Speicher innerhalb des Netzes, z.B. an einer Funkantenne oder einem Server, welche Anfragen an einen entfernten Inhalt direkt beantworten können, ohne die Anfrage an die oftmals weit entfernte Quelle weiterzuleiten. Das gelingt allerdings nicht in allen Fällen, sondern nur dann, wenn der Inhalt sich bereits im Cache befindet. Das kann entweder durch eine vorrangegangene Nutzeranfrage geschehen sein oder aber proaktiv ausgelöst werden. Eine Möglichkeit diese Inhalte proaktiv an Caches zu übertragen kann eine Multicast-Lösung sein, bei der mehrere Caches den gleichen Inhalt ausgeliefert bekommen, um ihn zu speichern. Das macht vor allem Sinn, wenn gleiche Anfragen an die verschiedenen Caches zu erwarten sind. Beispielsweise platziert Netflix Serien und Filme proaktiv in ihren Caches (innerhalb ihres CDNs OpenConnect).In dieser Arbeit soll das Zusammenspiel von Multicast und Caching untersucht werden sowie verschiedene Einsatzszenarien entworfen werden. Ein Szenario wurde oben bereits genannt: Das ausliefern von populären Inhalten an mehrere Caches gleichzeitig. Ein weiteres Szenario kann das Cachen an Mobilfunkantennen sein während die Auslieferung zu mehreren Smartphones z.B. über Multicast realisiert werden kann. Hierfür gibt es bereits technische Hilfsmittel wie den Multimedia Broadcast Multicast Service (MBMS). Abschließend soll das Einsparungspotential der im Rahmend er Arbeit entwickelten Ansätze untersucht und evaluiert werden. Einstiegsliteratur[1] Hao Feng, Zhiyong Chen and Hui Liu, “Minimizing Bandwidth Requirements for VoD Services with Client Caching”, in IEEE GLOCOM, 2016[2] Piotr Srebrny, Thomas Plagemann, Vera Goebel and Andreas Mauthe, “CacheCast: Eliminating redundant link traffic for single source multiple destination transfers”, in IEEE ICDCS 2010Christian Koch, M.Sc., M.Sc.ckoch@kom.tu-darmstadt.de",
                    "date": "Beitragvon ckoch » 20. Mär 2017 16:16",
                    "user": "ckoch"
                }
            ],
            "title": "MA: Video-Streaming-Datenverkehr durch einen Ansatz aus Caching und Multicast Reduzieren",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35835&sid=761560cc62e3c239d97418da17f17765",
            "views": "174"
        },
        {
            "answers": "0",
            "date": "20. Mär 2017 16:10",
            "thread": [
                {
                    "body_html": "<div class=\"content\">In mobilen Netzen spielt Videostreaming eine zunehmend wichtigere Rolle, was sich u.a. bei der stetigen Verbesserung der Internetverfügbarkeit z.B. in Zügen der Deutschen Bahn zeigt. Hier werden mehrere Mobilfunknetze zu einem WLAN gebündelt, um auch bei Nichtverfügbarkeit einzelner Netzte dennoch die Verbindung zum Internet zu ermöglichen. Dem Nutzer wird im Zug ein einzelnes WLAN angeboten, dass die verschiedenen zur Verfügung stehenden Mobilfunkverbindungen, die hinter dem WLAN stehen abstrahiert. <br/><br/>Es gibt jedoch auch Bereiche die von Zügen durchfahren werden, in welchen Mobilfunknetze gar nicht oder nur mit geringer Qualität verfügbar sind. In dieser Arbeit soll das Vorladen von Videosegmenten zur Überbrückung von Funklöchern untersucht werden. Hierzu kann auf eine Vorarbeit zurückgegriffen werden, bei der echte Sendemastinformationen wie Position und Signalstärke zur Verfügung gestellt werden. Ziel der Arbeit ist es verschiedene Mechanismen für das Vorladen zu entwerfen und zu evaluieren. Dazu soll auch ein Augenmerk auf die Kosten, sprich die Netzlast gelegt werden, da durch das Vorladen potentiell Videosegmente heruntergeladen werden, welche der Nutzer nicht anschaut, da er z.B. die Videostreaming-Session mangels Interesse abbricht. <br/><br/>Der Umfang der Arbeit kann abhängig davon, ob es sich um eine Bachelor-, Master-, oder Studienarbeit handelt angepasst und konkretisiert werden. Bei Rückfragen zur Aufgabenstellung stehe ich gern für ein persönliches Gespräch zur Verfügung.<br/><br/>Christian Koch, M.Sc., M.Sc.<br/><!-- e --><a href=\"mailto:ckoch@kom.tu-darmstadt.de\">ckoch@kom.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "In mobilen Netzen spielt Videostreaming eine zunehmend wichtigere Rolle, was sich u.a. bei der stetigen Verbesserung der Internetverfügbarkeit z.B. in Zügen der Deutschen Bahn zeigt. Hier werden mehrere Mobilfunknetze zu einem WLAN gebündelt, um auch bei Nichtverfügbarkeit einzelner Netzte dennoch die Verbindung zum Internet zu ermöglichen. Dem Nutzer wird im Zug ein einzelnes WLAN angeboten, dass die verschiedenen zur Verfügung stehenden Mobilfunkverbindungen, die hinter dem WLAN stehen abstrahiert. Es gibt jedoch auch Bereiche die von Zügen durchfahren werden, in welchen Mobilfunknetze gar nicht oder nur mit geringer Qualität verfügbar sind. In dieser Arbeit soll das Vorladen von Videosegmenten zur Überbrückung von Funklöchern untersucht werden. Hierzu kann auf eine Vorarbeit zurückgegriffen werden, bei der echte Sendemastinformationen wie Position und Signalstärke zur Verfügung gestellt werden. Ziel der Arbeit ist es verschiedene Mechanismen für das Vorladen zu entwerfen und zu evaluieren. Dazu soll auch ein Augenmerk auf die Kosten, sprich die Netzlast gelegt werden, da durch das Vorladen potentiell Videosegmente heruntergeladen werden, welche der Nutzer nicht anschaut, da er z.B. die Videostreaming-Session mangels Interesse abbricht. Der Umfang der Arbeit kann abhängig davon, ob es sich um eine Bachelor-, Master-, oder Studienarbeit handelt angepasst und konkretisiert werden. Bei Rückfragen zur Aufgabenstellung stehe ich gern für ein persönliches Gespräch zur Verfügung.Christian Koch, M.Sc., M.Sc.ckoch@kom.tu-darmstadt.de",
                    "date": "Beitragvon ckoch » 20. Mär 2017 16:10",
                    "user": "ckoch"
                }
            ],
            "title": "BA/MA: Überbrücken von Funklöchern beim Videostreamen in Mobilnetzen durch Vorladen von Videosegmenten",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35833&sid=761560cc62e3c239d97418da17f17765",
            "views": "167"
        },
        {
            "answers": "0",
            "date": "20. Mär 2017 16:09",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Multicast ist ein bewährter und etablierter Mechanismus um 1-zu-n Übertragungen, z.B. einen Live-Videostream effizient zu übertragen. Live-Streaming betrachtet dabei den Fall, das ein Video- oder auch Audiosignal zeitgleich an mehrere Geräte geschickt wird. Multicast kann jedoch auch für Übertragungen eingesetzt werden bei denen die Endgeräte nicht gleichzeitig, aber zeitnah gleichen Inhalt benötigen, z.B. Software-Updates. In dieser Arbeit soll ein weiterer Fall untersucht werden: on-demand Videos, z.B. YouTube-Videos können ebenfalls von Multicast profitieren – wenn auch nur in bestimmten Situationen. Dazu zählen Situationen in denen ein on-demand Video von mehreren Nutzern innerhalb eines kurzen Zeitfensters angefragt wird. Hier bietet sich die Möglichkeit den Teil des Videos welchen mehrere Nutzer noch nicht empfangen haben über Multicast auszuliefern, selbst wenn die Abspielpositionen einzelner Streams unterschiedlich sind. Das beschriebene Szenario trifft insbesondere auf populäre und virale Videos zu welche häufig und zeitnah angefragt werden.<br/> <br/>Im Rahmen dieser Abschlussarbeit soll das Potential von Multicast für solche Videos identifiziert werden. Dazu sollen verschiedene Datenquellen wie z.B. die Popularitätsentwicklung von YouTube-, Twitch-, oder YouNow-Videos untersucht und beschrieben werden. Dies soll durch geeignete API-Anfragen und/oder Website-Crawling (z.B. mittels <!-- m --><a class=\"postlink\" href=\"https://scrapy.org/\">https://scrapy.org/</a><!-- m -->) realisiert werden. Anschließend soll eine prototypische Implementierung entwickelt werden, die geeignete Videos für Multicast auswählt und das Potential zur Datenreduktion evaluiert.<br/><br/>Der Umfang der Arbeit kann abhängig davon, ob es sich um eine Bachelor-, Master-, oder Studienarbeit handelt angepasst und konkretisiert werden. Bei Rückfragen zur Aufgabenstellung stehe ich gern für ein persönliches Gespräch zur Verfügung.<br/><br/><br/>Christian Koch, M.Sc., M.Sc.<br/><!-- e --><a href=\"mailto:ckoch@kom.tu-darmstadt.de\">ckoch@kom.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Multicast ist ein bewährter und etablierter Mechanismus um 1-zu-n Übertragungen, z.B. einen Live-Videostream effizient zu übertragen. Live-Streaming betrachtet dabei den Fall, das ein Video- oder auch Audiosignal zeitgleich an mehrere Geräte geschickt wird. Multicast kann jedoch auch für Übertragungen eingesetzt werden bei denen die Endgeräte nicht gleichzeitig, aber zeitnah gleichen Inhalt benötigen, z.B. Software-Updates. In dieser Arbeit soll ein weiterer Fall untersucht werden: on-demand Videos, z.B. YouTube-Videos können ebenfalls von Multicast profitieren – wenn auch nur in bestimmten Situationen. Dazu zählen Situationen in denen ein on-demand Video von mehreren Nutzern innerhalb eines kurzen Zeitfensters angefragt wird. Hier bietet sich die Möglichkeit den Teil des Videos welchen mehrere Nutzer noch nicht empfangen haben über Multicast auszuliefern, selbst wenn die Abspielpositionen einzelner Streams unterschiedlich sind. Das beschriebene Szenario trifft insbesondere auf populäre und virale Videos zu welche häufig und zeitnah angefragt werden. Im Rahmen dieser Abschlussarbeit soll das Potential von Multicast für solche Videos identifiziert werden. Dazu sollen verschiedene Datenquellen wie z.B. die Popularitätsentwicklung von YouTube-, Twitch-, oder YouNow-Videos untersucht und beschrieben werden. Dies soll durch geeignete API-Anfragen und/oder Website-Crawling (z.B. mittels https://scrapy.org/) realisiert werden. Anschließend soll eine prototypische Implementierung entwickelt werden, die geeignete Videos für Multicast auswählt und das Potential zur Datenreduktion evaluiert.Der Umfang der Arbeit kann abhängig davon, ob es sich um eine Bachelor-, Master-, oder Studienarbeit handelt angepasst und konkretisiert werden. Bei Rückfragen zur Aufgabenstellung stehe ich gern für ein persönliches Gespräch zur Verfügung.Christian Koch, M.Sc., M.Sc.ckoch@kom.tu-darmstadt.de",
                    "date": "Beitragvon ckoch » 20. Mär 2017 16:09",
                    "user": "ckoch"
                }
            ],
            "title": "BA/MA: Multicast für Video-Streaming-Plattformen wie YouTube/Twitch/YouNow untersuchen",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35832&sid=761560cc62e3c239d97418da17f17765",
            "views": "187"
        },
        {
            "answers": "0",
            "date": "Neuester Beitrag",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Hallo zusammen,<br/><br/>ich suche Studenten für ein Praktikum bzw. eine Abschlussarbeit.<br/>Es handelt sich um eine Stelle in der Konzernforschung der Volkswagen AG im Bereich Augmented Reality und Maschinelles Lernen.<br/><br/>Zur Bewerbung oder für konkrete Informationen finden Sie die Stellenausschreibung unter folgendem Link:<br/><!-- m --><a class=\"postlink\" href=\"https://karriere.volkswagen.de/sap/bc/bsp/sap/zvw_hcmx_ui_ext/?jobId=58AD9E46EECA0ED0E10080000AFAA1FA\">https://karriere.volkswagen.de/sap/bc/b ... 000AFAA1FA</a><!-- m --><br/><br/>Viele Grüße,<br/>Kevin Thiel</div>",
                    "body_text": "Hallo zusammen,ich suche Studenten für ein Praktikum bzw. eine Abschlussarbeit.Es handelt sich um eine Stelle in der Konzernforschung der Volkswagen AG im Bereich Augmented Reality und Maschinelles Lernen.Zur Bewerbung oder für konkrete Informationen finden Sie die Stellenausschreibung unter folgendem Link:https://karriere.volkswagen.de/sap/bc/b ... 000AFAA1FAViele Grüße,Kevin Thiel",
                    "date": "Beitragvon Thiel » 15. Mär 2017 12:16",
                    "user": "Thiel"
                }
            ],
            "title": "Praktikum oder Abschlussarbeit - Volkswagen AG - Augmented Reality und Maschinelles Lernen",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35818&sid=761560cc62e3c239d97418da17f17765",
            "views": "255"
        },
        {
            "answers": "0",
            "date": "9. Mär 2017 14:02",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Hi,<br/><br/>the DEEDS group offers theses on the topic \"Virtual Machine Placement Algorithms in the Cloud\".<br/>A more detailed description of the proposal is attached.<br/><br/>Best regards,<br/>Tsvetoslava</div>",
                    "body_text": "Hi,the DEEDS group offers theses on the topic \"Virtual Machine Placement Algorithms in the Cloud\".A more detailed description of the proposal is attached.Best regards,Tsvetoslava",
                    "date": "Beitragvon vateva-gurova » 9. Mär 2017 14:02",
                    "user": "vateva-gurova"
                }
            ],
            "title": "BSc./MSc. Virtual Machine Placement Algorithms in the Cloud",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=33820&sid=761560cc62e3c239d97418da17f17765",
            "views": "343"
        },
        {
            "answers": "0",
            "date": "9. Mär 2017 14:00",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Hi,<br/><br/>the DEEDS group offers a Bachelor's thesis which can be extended also as a Master's thesis on the topic \"Susceptibility of cache models to covert-channel attacks\".<br/>A more detailed description of the proposal is attached.<br/><br/>Best regards,<br/>Tsvetoslava</div>",
                    "body_text": "Hi,the DEEDS group offers a Bachelor's thesis which can be extended also as a Master's thesis on the topic \"Susceptibility of cache models to covert-channel attacks\".A more detailed description of the proposal is attached.Best regards,Tsvetoslava",
                    "date": "Beitragvon vateva-gurova » 9. Mär 2017 14:00",
                    "user": "vateva-gurova"
                }
            ],
            "title": "BSc/MSc:Susceptibility of cache models to CCAs",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=30271&sid=761560cc62e3c239d97418da17f17765",
            "views": "376"
        },
        {
            "answers": "0",
            "date": "7. Mär 2017 19:26",
            "thread": [
                {
                    "body_html": "<div class=\"content\"><span style=\"text-decoration: underline\">Master thesis student position</span><br/> <br/>Comparing the effects of radiation on current key storage<br/>solutions and on Physical Unclonable Functions (PUFs)<br/>being used as key storage<br/><br/>The Security Engineering group of TU Darmstadt (<!-- m --><a class=\"postlink\" href=\"http://www.seceng.de/\">http://www.seceng.de/</a><!-- m -->) is looking for a student to work on the effects of radiation on different key storage solutions as the topic of a master thesis. The student will have to both study current literature on this field and also contact practical radiation experiments in collaboration with Klinikum Darmstadt. This thesis will be offered in collaboration with Klinikum Darmstadt, with which a partnership already exists.<br/><br/><strong>Work objectives</strong><br/><br/>We want to test how current key storage components, such as DRAM and Flash memory, respond to radiation, in order to determine their suitability in high-radiation environments, such as nuclear plants or the outer space. In addition, we also want to examine whether PUFs may prove to be more resistant to radiation than current key storage solutions and could potentially more easily recover from non-persistent faults.<br/>We would therefore like you to work with the STM Discovery and STM Nucleo boards in order to produce code which can access current key storage memory regions and inherent PUFs, and which can then be used to check the integrity of keys stored there. You would then proceed to optimise such code and test the different key storage solutions under radiation, in experiments organised in Klinikum Darmstadt.<br/>Finally, you would work on a thesis based on relevant literature and the results of the experiments you have conducted.<br/><br/><strong>Your profile</strong><br/><br/>You need to:<br/>→ be creative and <strong>willing to work towards your goal</strong>.<br/>→ be able to adhere to safety rules, guidelines and procedures.<br/>→ have good programming skills in C and C++, especially for embedded systems.<br/>→ be able to work on both Windows and Linux.<br/>→ be able to write reports and present your results in English.<br/><br/>Comprehensive hands-on experience in embedded systems and evaluation boards is a major advantage, but not a formal requirement. An interest in particle physics and/or knowledge of physics beyond the secondary school level is also a further advantage.<br/><br/><strong>Contact us</strong><br/><br/>If you're interested in working on this exciting topic and on contacting practical radiation experiments on memories and other key storage components, please contact: <br/>\t→\t<!-- e --><a href=\"mailto:anagnostopoulos@seceng.informatik.tu-darmstadt.de\">anagnostopoulos@seceng.informatik.tu-darmstadt.de</a><!-- e --><br/>\t→\t<!-- m --><a class=\"postlink\" href=\"http://www.seceng.informatik.tu-darmstadt.de/people/anagnostopoulos/\">http://www.seceng.informatik.tu-darmsta ... stopoulos/</a><!-- m --></div>",
                    "body_text": "Master thesis student position Comparing the effects of radiation on current key storagesolutions and on Physical Unclonable Functions (PUFs)being used as key storageThe Security Engineering group of TU Darmstadt (http://www.seceng.de/) is looking for a student to work on the effects of radiation on different key storage solutions as the topic of a master thesis. The student will have to both study current literature on this field and also contact practical radiation experiments in collaboration with Klinikum Darmstadt. This thesis will be offered in collaboration with Klinikum Darmstadt, with which a partnership already exists.Work objectivesWe want to test how current key storage components, such as DRAM and Flash memory, respond to radiation, in order to determine their suitability in high-radiation environments, such as nuclear plants or the outer space. In addition, we also want to examine whether PUFs may prove to be more resistant to radiation than current key storage solutions and could potentially more easily recover from non-persistent faults.We would therefore like you to work with the STM Discovery and STM Nucleo boards in order to produce code which can access current key storage memory regions and inherent PUFs, and which can then be used to check the integrity of keys stored there. You would then proceed to optimise such code and test the different key storage solutions under radiation, in experiments organised in Klinikum Darmstadt.Finally, you would work on a thesis based on relevant literature and the results of the experiments you have conducted.Your profileYou need to:→ be creative and willing to work towards your goal.→ be able to adhere to safety rules, guidelines and procedures.→ have good programming skills in C and C++, especially for embedded systems.→ be able to work on both Windows and Linux.→ be able to write reports and present your results in English.Comprehensive hands-on experience in embedded systems and evaluation boards is a major advantage, but not a formal requirement. An interest in particle physics and/or knowledge of physics beyond the secondary school level is also a further advantage.Contact usIf you're interested in working on this exciting topic and on contacting practical radiation experiments on memories and other key storage components, please contact: \t→\tanagnostopoulos@seceng.informatik.tu-darmstadt.de\t→\thttp://www.seceng.informatik.tu-darmsta ... stopoulos/",
                    "date": "Beitragvon athanagn » 7. Mär 2017 19:26",
                    "user": "athanagn"
                }
            ],
            "title": "Thesis: Comparing the effects of radiation on current key storage solutions and on Physical Unclonable Functions (PUFs)",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35773&sid=761560cc62e3c239d97418da17f17765",
            "views": "82"
        },
        {
            "answers": "0",
            "date": "1. Mär 2017 13:42",
            "thread": [
                {
                    "body_html": "<div class=\"content\">The DEEDS group offers theses on the topic \"Virtual Machine Placement Algorithms in the Cloud\".<br/>A more detailed description of the proposal is attached.</div>",
                    "body_text": "The DEEDS group offers theses on the topic \"Virtual Machine Placement Algorithms in the Cloud\".A more detailed description of the proposal is attached.",
                    "date": "Beitragvon vateva-gurova » 1. Mär 2017 13:42",
                    "user": "vateva-gurova"
                }
            ],
            "title": "BSc./MSc. Virtual Machine Placement Algorithms in the Cloud",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35693&sid=761560cc62e3c239d97418da17f17765",
            "views": "111"
        },
        {
            "answers": "0",
            "date": "28. Feb 2017 17:31",
            "thread": [
                {
                    "body_html": "<div class=\"content\">=== gelöscht ===</div>",
                    "body_text": "=== gelöscht ===",
                    "date": "Beitragvon sfahnens » 28. Feb 2017 17:31",
                    "user": "sfahnens"
                }
            ],
            "title": "Bachelorarbeit: Reisendenströme im ÖV aus Mobilfunknetzbetreibersicht",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35688&sid=761560cc62e3c239d97418da17f17765",
            "views": "106"
        },
        {
            "answers": "0",
            "date": "25. Feb 2017 23:18",
            "thread": [
                {
                    "body_html": "<div class=\"content\"><strong>Topic Description:</strong><br/>Event stream processing (ESP) systems allows continuous queries on the stream of incoming data. Such systems are capable of processing streams from disparate sources to compute result in real-time. But video stream processing is a costly operation both in terms of time, computing and network resources. In such a case online computing resources, e.g., by cloud computing can be leveraged. However all the operations are not resource-intensive. Increasing amount of smart devices and their computing abilities have enabled processing at edges. Computing at the edges substantially reduces the latency on the other hand; computing at cloud provides high compute power. Existing stream processing systems like Apache Storm provides model for composing such video stream processing applications for commodity clusters (at edge) and cloud. However when the functions are distributed, there arise open questions such as which functions go to edge, which go to Cloud, and so on.<br/>If you like to work on this topic* please get in touch with anyone of us.<br/><br/><strong>Milestones to be achieved:</strong><br/>(a) Related work research on data stream processing systems (DSPS) and data stream management systems (DSMS) involving processing at cloud and edge networks in context of video streaming applications.<br/>(b) Design of a scheduling algorithm that decides assignment of operator numerous nodes available in the topology.<br/>(c) Design of an architecture (incl. b) that enables deploying operators at cloud and edge.<br/>(d) Implementation and evaluation of the designed architecture over the quality-of-service parameters.<br/><br/>Student should be motivated and have following skills:<br/>(a) Interest in communication networks, video and stream processing systems.<br/>(b) Good programming skills in Java.<br/><br/>*The thesis can be started asap and the duration will be 6 months.</div>",
                    "body_text": "Topic Description:Event stream processing (ESP) systems allows continuous queries on the stream of incoming data. Such systems are capable of processing streams from disparate sources to compute result in real-time. But video stream processing is a costly operation both in terms of time, computing and network resources. In such a case online computing resources, e.g., by cloud computing can be leveraged. However all the operations are not resource-intensive. Increasing amount of smart devices and their computing abilities have enabled processing at edges. Computing at the edges substantially reduces the latency on the other hand; computing at cloud provides high compute power. Existing stream processing systems like Apache Storm provides model for composing such video stream processing applications for commodity clusters (at edge) and cloud. However when the functions are distributed, there arise open questions such as which functions go to edge, which go to Cloud, and so on.If you like to work on this topic* please get in touch with anyone of us.Milestones to be achieved:(a) Related work research on data stream processing systems (DSPS) and data stream management systems (DSMS) involving processing at cloud and edge networks in context of video streaming applications.(b) Design of a scheduling algorithm that decides assignment of operator numerous nodes available in the topology.(c) Design of an architecture (incl. b) that enables deploying operators at cloud and edge.(d) Implementation and evaluation of the designed architecture over the quality-of-service parameters.Student should be motivated and have following skills:(a) Interest in communication networks, video and stream processing systems.(b) Good programming skills in Java.*The thesis can be started asap and the duration will be 6 months.",
                    "date": "Beitragvon manisha.luthra » 25. Feb 2017 23:18",
                    "user": "manisha.luthra"
                }
            ],
            "title": "Bachelor/Master Thesis: Distributed stream processing in Apache Storm for real-time video streaming applications",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35673&sid=761560cc62e3c239d97418da17f17765",
            "views": "169"
        },
        {
            "answers": "0",
            "date": "Neuester Beitrag",
            "thread": [
                {
                    "body_html": "<div class=\"content\"><strong>Praktikum und/oder Bachelor-/Masterarbeit  (Kombination möglich)</strong><br/><span style=\"font-size: 150%; line-height: normal\">Vollständige Neuentwicklung und Implementierung eines flexiblen Frameworks zur Simulation des zukünftigen Automobilmarktes auf Basis des Monte-Carlo-Verfahrens und großer Datenmengen</span><br/><br/><strong>mehr Infos auf: <!-- m --><a class=\"postlink\" href=\"http://www.vector21.de/studenten\">http://www.vector21.de/studenten</a><!-- m --></strong><br/><br/>Tauche ein in die Welt der Spitzenforschung am Deutschen Zentrum für Luft- und Raumfahrt. Arbeite gemeinsam mit rund 7300 Mitarbeiterinnen und Mitarbeitern an den Innovationen von Morgen. Am Institut für Fahrzeugkonzepte in Stuttgart entwickeln wir bereits seit 2007 Software zur Simulation von Fahrzeugmärkten. Diese Software soll nun von Grund auf neu gestaltet und neu implementiert werden. In unserem agilen Softwareentwicklungsprozess arbeiten wir mit führenden Automobilherstellern, Zulieferern und Unternehmensberatungen zusammen. Diese werden als potentielle zukünftige Nutzer in enger Zusammenarbeit mit uns ihr Feedback in unseren Entwicklungsprozess einfließen lassen. <br/><br/>Unser Ziel ist es eine Software zu gestalten, die die Arbeitsweisen in Strategieabteilungen und Unternehmensberatungen revolutioniert. Hochdetaillierte, auf großen Datenmengen basierende Simulationen sollen zeiteffizient und komfortabel durchgeführt werden. Dies erfordert die Ausführung komplexer Berechnungen und umfangreicher Datenoperationen innerhalb kürzester Zeit. Um eine flexible Anwendbarkeit der Software zu gewährleisten, soll diese möglichst generisch und durch den Nutzer erweiterbar gestaltet werden. Dazu nutzen wir Graphentheorie, funktionale und reaktive Programmierung, Parallelisierung und die Integration von Code zur Laufzeit. Die Software basiert auf Python 3.6 in Kombination mit AutobahnPython und Pandas/Numba. Weitere Informationen zum Projekt sind auf <!-- m --><a class=\"postlink\" href=\"http://www.vector21.de\">http://www.vector21.de</a><!-- m --> zu finden.<br/><br/>Gemeinsam mit unserem Softwareentwicklungsteam kannst du deinen Aufgabenbereich nach deinen Neigungen und Kompetenzen festlegen. In diesem Bereich verantwortest du die Entwicklung deiner Lösung von der Konzeption bis zur finalen Implementierung. Je nach deiner Studiensituation bieten wir dir ein Pflichtpraktikum oder eine Abschlussarbeit an. Unsere Praktika werden vergütet. Du kannst ab sofort beginnen.<br/><br/>Wir suchen eine Studentin oder einen Studenten aus dem Bereich Informatik, der sehr gute Leistungen auf seinem Gebiet vorweisen kann. Erfahrung in Softwareentwicklung und –architektur, Python und den verwendeten Technologien sind von Vorteil. Besonders wichtig ist uns die Fähigkeit und Offenheit zur eigenständigen Einarbeitung in neue Bereiche und die Bereitschaft über den eigenen Tellerrand hinaus zu denken.<br/><br/>Fachliche Fragen beantwortet dir gern Herr Danny Calliari telefonisch unter 0711 6862-8267 sowie per E-Mail (danny.calliari[at]dlr.de). Bewerben kannst du dich online über <!-- m --><a class=\"postlink\" href=\"http://www.DLR.de/jobs\">http://www.DLR.de/jobs</a><!-- m --> oder direkt per E-Mail an Herrn Calliari. Schwerbehinderte Bewerberinnen bevorzugen wir bei fachlicher Eignung. Hinweis: Eine Abschlussarbeit muss von einem Professor deiner Universität betreut werden.</div>",
                    "body_text": "Praktikum und/oder Bachelor-/Masterarbeit  (Kombination möglich)Vollständige Neuentwicklung und Implementierung eines flexiblen Frameworks zur Simulation des zukünftigen Automobilmarktes auf Basis des Monte-Carlo-Verfahrens und großer Datenmengenmehr Infos auf: http://www.vector21.de/studentenTauche ein in die Welt der Spitzenforschung am Deutschen Zentrum für Luft- und Raumfahrt. Arbeite gemeinsam mit rund 7300 Mitarbeiterinnen und Mitarbeitern an den Innovationen von Morgen. Am Institut für Fahrzeugkonzepte in Stuttgart entwickeln wir bereits seit 2007 Software zur Simulation von Fahrzeugmärkten. Diese Software soll nun von Grund auf neu gestaltet und neu implementiert werden. In unserem agilen Softwareentwicklungsprozess arbeiten wir mit führenden Automobilherstellern, Zulieferern und Unternehmensberatungen zusammen. Diese werden als potentielle zukünftige Nutzer in enger Zusammenarbeit mit uns ihr Feedback in unseren Entwicklungsprozess einfließen lassen. Unser Ziel ist es eine Software zu gestalten, die die Arbeitsweisen in Strategieabteilungen und Unternehmensberatungen revolutioniert. Hochdetaillierte, auf großen Datenmengen basierende Simulationen sollen zeiteffizient und komfortabel durchgeführt werden. Dies erfordert die Ausführung komplexer Berechnungen und umfangreicher Datenoperationen innerhalb kürzester Zeit. Um eine flexible Anwendbarkeit der Software zu gewährleisten, soll diese möglichst generisch und durch den Nutzer erweiterbar gestaltet werden. Dazu nutzen wir Graphentheorie, funktionale und reaktive Programmierung, Parallelisierung und die Integration von Code zur Laufzeit. Die Software basiert auf Python 3.6 in Kombination mit AutobahnPython und Pandas/Numba. Weitere Informationen zum Projekt sind auf http://www.vector21.de zu finden.Gemeinsam mit unserem Softwareentwicklungsteam kannst du deinen Aufgabenbereich nach deinen Neigungen und Kompetenzen festlegen. In diesem Bereich verantwortest du die Entwicklung deiner Lösung von der Konzeption bis zur finalen Implementierung. Je nach deiner Studiensituation bieten wir dir ein Pflichtpraktikum oder eine Abschlussarbeit an. Unsere Praktika werden vergütet. Du kannst ab sofort beginnen.Wir suchen eine Studentin oder einen Studenten aus dem Bereich Informatik, der sehr gute Leistungen auf seinem Gebiet vorweisen kann. Erfahrung in Softwareentwicklung und –architektur, Python und den verwendeten Technologien sind von Vorteil. Besonders wichtig ist uns die Fähigkeit und Offenheit zur eigenständigen Einarbeitung in neue Bereiche und die Bereitschaft über den eigenen Tellerrand hinaus zu denken.Fachliche Fragen beantwortet dir gern Herr Danny Calliari telefonisch unter 0711 6862-8267 sowie per E-Mail (danny.calliari[at]dlr.de). Bewerben kannst du dich online über http://www.DLR.de/jobs oder direkt per E-Mail an Herrn Calliari. Schwerbehinderte Bewerberinnen bevorzugen wir bei fachlicher Eignung. Hinweis: Eine Abschlussarbeit muss von einem Professor deiner Universität betreut werden.",
                    "date": "Beitragvon Danny Calliari » 24. Feb 2017 14:21",
                    "user": "Danny Calliari"
                }
            ],
            "title": "Entwickle ein Framework zur Simulation des Automobilmarktes der Zukunft am Deutsches Zentrum für Luft- und Raumfahrt",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35670&sid=761560cc62e3c239d97418da17f17765",
            "views": "107"
        },
        {
            "answers": "0",
            "date": "Neuester Beitrag",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Vehicle to vehicle and vehicle to infrastructure (V2X) communication is a promising technology for increasing traffic safety and traffic efficiency. With this technology, stations of the intelligent transportation system (ITS) broadcast over a wireless channel frequently small messages that can be received and processed by all stations in communication range. Because of the “open” channel, security is an enabler of the technology. It has to be ensured that only valid and trustworthy senders participate and that transmitted information is not manipulated or faked. Misbehaving stations must be detected and reported to the security backend.<br/><br/>In this master thesis, a solution should be developed that considers the processing of misbehavior reports in the security backend in order to exclude affected ITS stations from sending valid V2X messages as active network node. After an analysis of existing work on the topic of processing of misbehavior reports, a concept should be developed that fit into the standardized V2X security architecture by respecting the defined security and privacy protection requirements of V2X communications. Finally, an evaluation of the concept should be done with a proof of concept implementation.<br/>We are looking for a student (m/f) to construct his or her Master Thesis in Bochum at the earliest opportunity.<br/><br/>We are looking for a student (m/f) to construct his or her Master Thesis at ESCRYPT in Bochum at the earliest opportunity.<br/><!-- m --><a class=\"postlink\" href=\"https://www.escrypt.com/fileadmin/escrypt/jobs/MTMD-1702-BO.pdf\">https://www.escrypt.com/fileadmin/escry ... 702-BO.pdf</a><!-- m --><br/><br/><span style=\"text-decoration: underline\">Goals</span><br/>* Analyze and evaluate related work for processing misbehavior detections<br/>* Development of a concept for processing misbehavior reports<br/>* Evaluate the concept with a proof of concept implementation based on the ESCRYPT key management solution<br/><br/><span style=\"text-decoration: underline\">Our technical requirements</span><br/>You are studying computer science, electrical engineering or mathematics in a master’s course and you are one of the best in your year. You have profound knowledge of the following topics:<br/>* IT security and cryptography, i.e. elliptic curve public-key cryptography<br/>* Communication protocols and computer networks<br/>* Security analysis and security concepts<br/>* Secure Software development with Java<br/><br/><span style=\"text-decoration: underline\">Your personal qualifications</span><br/>* Self-initiated way of working<br/>* Team spirit and communication skills<br/>* Responsibility and high quality demands <br/><br/><span style=\"text-decoration: underline\">Our offer</span><br/>We take your career seriously and offer the possibility to grow with us in a highly qualified, internationally experienced team. Our work environment is harmonic and team oriented, and at the same time, challenging and interesting. We always look to achieve best results, and to learn something new on every day.<br/><br/>Please send us your complete application papers with key number MTMD-1702-BO by email to <!-- e --><a href=\"mailto:jobs@escrypt.com\">jobs@escrypt.com</a><!-- e -->.<br/><br/><span style=\"text-decoration: underline\">Still questions?</span><br/>Norbert Bissmeyer<br/>Email: <!-- e --><a href=\"mailto:norbert.bissmeyer@escrypt.com\">norbert.bissmeyer@escrypt.com</a><!-- e --><br/>Phone: +49 234 43870-243</div>",
                    "body_text": "Vehicle to vehicle and vehicle to infrastructure (V2X) communication is a promising technology for increasing traffic safety and traffic efficiency. With this technology, stations of the intelligent transportation system (ITS) broadcast over a wireless channel frequently small messages that can be received and processed by all stations in communication range. Because of the “open” channel, security is an enabler of the technology. It has to be ensured that only valid and trustworthy senders participate and that transmitted information is not manipulated or faked. Misbehaving stations must be detected and reported to the security backend.In this master thesis, a solution should be developed that considers the processing of misbehavior reports in the security backend in order to exclude affected ITS stations from sending valid V2X messages as active network node. After an analysis of existing work on the topic of processing of misbehavior reports, a concept should be developed that fit into the standardized V2X security architecture by respecting the defined security and privacy protection requirements of V2X communications. Finally, an evaluation of the concept should be done with a proof of concept implementation.We are looking for a student (m/f) to construct his or her Master Thesis in Bochum at the earliest opportunity.We are looking for a student (m/f) to construct his or her Master Thesis at ESCRYPT in Bochum at the earliest opportunity.https://www.escrypt.com/fileadmin/escry ... 702-BO.pdfGoals* Analyze and evaluate related work for processing misbehavior detections* Development of a concept for processing misbehavior reports* Evaluate the concept with a proof of concept implementation based on the ESCRYPT key management solutionOur technical requirementsYou are studying computer science, electrical engineering or mathematics in a master’s course and you are one of the best in your year. You have profound knowledge of the following topics:* IT security and cryptography, i.e. elliptic curve public-key cryptography* Communication protocols and computer networks* Security analysis and security concepts* Secure Software development with JavaYour personal qualifications* Self-initiated way of working* Team spirit and communication skills* Responsibility and high quality demands Our offerWe take your career seriously and offer the possibility to grow with us in a highly qualified, internationally experienced team. Our work environment is harmonic and team oriented, and at the same time, challenging and interesting. We always look to achieve best results, and to learn something new on every day.Please send us your complete application papers with key number MTMD-1702-BO by email to jobs@escrypt.com.Still questions?Norbert BissmeyerEmail: norbert.bissmeyer@escrypt.comPhone: +49 234 43870-243",
                    "date": "Beitragvon Gast » 24. Feb 2017 10:55",
                    "user": "Gast"
                }
            ],
            "title": "Master Thesis: Excluding misbehaving nodes from active Vehicle-to-X Communications",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35668&sid=761560cc62e3c239d97418da17f17765",
            "views": "82"
        },
        {
            "answers": "0",
            "date": "Neuester Beitrag",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Vehicle to vehicle and vehicle to infrastructure (V2X) communication is a promising technology for increasing traffic safety and traffic efficiency. With the currently standardized solution, small messages are broadcasted with high frequency over wireless ad-hoc channels applying frequencies next to the WLAN band. Because of the “open” channel, security is an enabler of the technology. It has to be ensured that only valid and trustworthy senders participate and that transmitted information is not manipulated or faked. <br/><br/>To make cellular networks also usable for V2X communication, the 3GPP is working on a profile for extending the LTE standard to allow direct V2X message exchange between network nodes inside cells of the network operator. Since the message protection is ensured in the WLAN-based V2X communication by applying public key cryptography and in LTE with symmetric keys it should be analyzed in this Master thesis how these two security solutions fit together to allow a hybrid solution that provides a secure low latency wireless ad-hoc communication between vehicles and between vehicles and the infrastructure.<br/><br/>We are looking for a student (m/f) to construct his or her Master Thesis at ESCRYPT in Bochum at the earliest opportunity.<br/><!-- m --><a class=\"postlink\" href=\"https://www.escrypt.com/fileadmin/escrypt/jobs/MTLTE-1702-BO.pdf\">https://www.escrypt.com/fileadmin/escry ... 702-BO.pdf</a><!-- m --><br/><br/><span style=\"text-decoration: underline\">Goals</span><br/>* Analyze relevant security goals of V2X communication<br/>* Evaluate the LTE-V2X profile of 3GPP<br/>* Describing a concept to fulfill security requirements to secure LTE-V2X communication<br/>* Evaluate the concept with a proof of concept implementation<br/><br/><span style=\"text-decoration: underline\">Our technical requirements</span><br/>You are studying computer science, electrical engineering or mathematics in a master’s course and you are one of the best in your year. You have profound knowledge of the following topics:<br/>* IT security and cryptography , i.e. elliptic curve public-key cryptography<br/>* Communication protocols and computer networks, i.e. cellular networks<br/>* Security analysis and security concepts<br/>* Trusted computing and hardware security modules<br/><br/><span style=\"text-decoration: underline\">Your personal qualifications</span><br/>* Self-initiated way of working<br/>* Team spirit and communication skills<br/>* Responsibility and high quality demands <br/><br/><span style=\"text-decoration: underline\">Our offer</span><br/>We take your career seriously and offer the possibility to grow with us in a highly qualified, internationally experienced team. Our work environment is harmonic and team oriented, and at the same time, challenging and interesting. We always look to achieve best results, and to learn something new on every day.<br/><br/>Please send us your complete application papers with key number MTLTE-1702-BO by email to <!-- e --><a href=\"mailto:jobs@escrypt.com\">jobs@escrypt.com</a><!-- e -->.<br/><br/><span style=\"text-decoration: underline\">Still questions?</span><br/>Norbert Bissmeyer<br/>Email: <!-- e --><a href=\"mailto:norbert.bissmeyer@escrypt.com\">norbert.bissmeyer@escrypt.com</a><!-- e --><br/>Phone: +49 234 43870-243</div>",
                    "body_text": "Vehicle to vehicle and vehicle to infrastructure (V2X) communication is a promising technology for increasing traffic safety and traffic efficiency. With the currently standardized solution, small messages are broadcasted with high frequency over wireless ad-hoc channels applying frequencies next to the WLAN band. Because of the “open” channel, security is an enabler of the technology. It has to be ensured that only valid and trustworthy senders participate and that transmitted information is not manipulated or faked. To make cellular networks also usable for V2X communication, the 3GPP is working on a profile for extending the LTE standard to allow direct V2X message exchange between network nodes inside cells of the network operator. Since the message protection is ensured in the WLAN-based V2X communication by applying public key cryptography and in LTE with symmetric keys it should be analyzed in this Master thesis how these two security solutions fit together to allow a hybrid solution that provides a secure low latency wireless ad-hoc communication between vehicles and between vehicles and the infrastructure.We are looking for a student (m/f) to construct his or her Master Thesis at ESCRYPT in Bochum at the earliest opportunity.https://www.escrypt.com/fileadmin/escry ... 702-BO.pdfGoals* Analyze relevant security goals of V2X communication* Evaluate the LTE-V2X profile of 3GPP* Describing a concept to fulfill security requirements to secure LTE-V2X communication* Evaluate the concept with a proof of concept implementationOur technical requirementsYou are studying computer science, electrical engineering or mathematics in a master’s course and you are one of the best in your year. You have profound knowledge of the following topics:* IT security and cryptography , i.e. elliptic curve public-key cryptography* Communication protocols and computer networks, i.e. cellular networks* Security analysis and security concepts* Trusted computing and hardware security modulesYour personal qualifications* Self-initiated way of working* Team spirit and communication skills* Responsibility and high quality demands Our offerWe take your career seriously and offer the possibility to grow with us in a highly qualified, internationally experienced team. Our work environment is harmonic and team oriented, and at the same time, challenging and interesting. We always look to achieve best results, and to learn something new on every day.Please send us your complete application papers with key number MTLTE-1702-BO by email to jobs@escrypt.com.Still questions?Norbert BissmeyerEmail: norbert.bissmeyer@escrypt.comPhone: +49 234 43870-243",
                    "date": "Beitragvon Gast » 24. Feb 2017 10:54",
                    "user": "Gast"
                }
            ],
            "title": "Master Thesis: Securing Vehicle-to-X Ad-hoc Communication over LTE-V2X",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35667&sid=761560cc62e3c239d97418da17f17765",
            "views": "70"
        },
        {
            "answers": "1",
            "date": "Neuester Beitrag",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Hallo Zusammen, <br/><br/>alle die nach einem Thema für Ihre Abschlussarbeit im Unternehmen suchen, einfach mal auf <!-- m --><a class=\"postlink\" href=\"http://www.die-bachelorarbeit.de\">http://www.die-bachelorarbeit.de</a><!-- m --> oder <!-- m --><a class=\"postlink\" href=\"http://www.die-masterarbeit.de\">http://www.die-masterarbeit.de</a><!-- m --> gehen. Dort gibt es mehr als 1400 aktuelle Themen von Unternehmen. Gerade auch im Fachbereich IT. <br/><br/>Also, einfach mal durchklicken! <br/><br/>Beste Grüße, <br/>Leon</div>",
                    "body_text": "Hallo Zusammen, alle die nach einem Thema für Ihre Abschlussarbeit im Unternehmen suchen, einfach mal auf http://www.die-bachelorarbeit.de oder http://www.die-masterarbeit.de gehen. Dort gibt es mehr als 1400 aktuelle Themen von Unternehmen. Gerade auch im Fachbereich IT. Also, einfach mal durchklicken! Beste Grüße, Leon",
                    "date": "Beitragvon Tom_Kehl » 24. Jun 2015 17:13",
                    "user": "Tom_Kehl"
                },
                {
                    "body_html": "<div class=\"content\">Hi,<br/>ich habe vor einigen Tagen meine Bachelorarbeit abgegeben. Während ich die Arbeit geschrieben habe, hat mir diese <a class=\"postlink\" href=\"http://bachelorarbeit-ghostwriter.de/\">Agentur</a> sehr geholfen. Sie haben mir einige gute Richtlinien gegeben, an die ich mich beim Schreiben halten sollte und haben vor der Abgabe das Korrekturlesen gemacht.<br/>Ich habe am Ende eine wirklich gute Bachelorarbeit abgegeben, die ich mit ein wenig Hilfe selbst geschrieben habe.<br/>Vor allem das Korrekturlesen kann ich sehr empfehlen, denn oft übersieht man einfach einige kleine Fehler.<br/>Viele Grüße</div>",
                    "body_text": "Hi,ich habe vor einigen Tagen meine Bachelorarbeit abgegeben. Während ich die Arbeit geschrieben habe, hat mir diese Agentur sehr geholfen. Sie haben mir einige gute Richtlinien gegeben, an die ich mich beim Schreiben halten sollte und haben vor der Abgabe das Korrekturlesen gemacht.Ich habe am Ende eine wirklich gute Bachelorarbeit abgegeben, die ich mit ein wenig Hilfe selbst geschrieben habe.Vor allem das Korrekturlesen kann ich sehr empfehlen, denn oft übersieht man einfach einige kleine Fehler.Viele Grüße",
                    "date": "Beitragvon Thobias » 22. Feb 2017 18:12",
                    "user": "Thobias"
                }
            ],
            "title": "Abschlussarbeit im Unternehmen",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=32564&sid=761560cc62e3c239d97418da17f17765",
            "views": "497"
        },
        {
            "answers": "0",
            "date": "17. Feb 2017 16:49",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Hallo zusammen,<br/>Im Fachgebiet Telekooperation ist ab sofort eine Bachelorarbeit zu vergeben. Details hierzu bitte siehe angehängtes PDF.<br/>Wenn ihr an der Arbeit Interesse habt, würde ich mich freuen, von euch zu hören.<br/><br/>Gruß,<br/>Julien<br/>------------------------------------<br/>Kontakt bei Interesse:<br/>Julien Gedeon / Raum A124<br/><!-- e --><a href=\"mailto:gedeon@tk.tu-darmstadt.de\">gedeon@tk.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Hallo zusammen,Im Fachgebiet Telekooperation ist ab sofort eine Bachelorarbeit zu vergeben. Details hierzu bitte siehe angehängtes PDF.Wenn ihr an der Arbeit Interesse habt, würde ich mich freuen, von euch zu hören.Gruß,Julien------------------------------------Kontakt bei Interesse:Julien Gedeon / Raum A124gedeon@tk.tu-darmstadt.de",
                    "date": "Beitragvon julien » 17. Feb 2017 16:49",
                    "user": "julien"
                }
            ],
            "title": "Bachelorarbeit: V-Storage für Android",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35592&sid=761560cc62e3c239d97418da17f17765",
            "views": "147"
        },
        {
            "answers": "0",
            "date": "17. Feb 2017 10:08",
            "thread": [
                {
                    "body_html": "<div class=\"content\">The <strong>Security Engineering Group</strong> (<a class=\"postlink\" href=\"http://www.seceng.de\">http://www.seceng.de</a>) is providing the opportunity to supervise a Bachelor-Thesis or a student assistant (HiWi) position in the field of hardware-based security. The core idea of the project is to implement and evaluate a Physically Unclonable Function instance called the <em>Rowhammer-PUF</em> on embedded systems.<br/><br/><strong>The Project:</strong><br/>The project is based on prior work of our group on the Rowhammer-PUF. The Rowhammer-PUF is based on the Rowhammer effect existent in most DRAM modules[1]. While being mainly regarded as a critical security issue in the literature, we exploit the Rowhammer effect in a constructive way, in order to extract an instance of a so-called Physically Unclonable Function[2]. The resulting Rowhammer-PUF was already implemented  and evaluated on an embedded platform, the PandaBoard[3] by our group.<br/><br/>The project's goal is to develop a Linux kernel module that makes the PUF instance accessible to the Linux kernel.<br/><br/><strong>Your Tasks:</strong><br/>Your <em>main</em> task is to use our existing implementation, which is done in the bootloader of the PandaBoard, in order to come up with a Linux kernel module of the code. Once this is done, a <em>secondary</em> goal is to use our bootloader-based implementation as well as your developed kernel module, in order to further optimize the implementation to retrieve PUF characteristics of improved quality.<br/><br/>Therefore, you will first have to get used to the PandaBoard development platform, learn how to program and flash the board. Next, you will become familiar with our existing code and simultaneously with the corresponding registers of the PandaBoard by reading through the Technical Reference Manual (data sheet) of the board. Once understood the functionality of the existing code, you will port it to a Linux kernel module and test it's functionality. Finally, you will optimize our code as well as your newly developed code towards predefined goals.<br/><br/><strong>Your Profil:</strong><br/><ul><li>Your are studying computer science or electrical engineering.</li><li>You have good experience in programming with c.</li><li>Your are familiar with (ARM-based) microcontroller programming / bare-metal programming and working with IDEs such as Keil as well as Code Composer Studio.</li><li>You are in favor of hands-on, hardware-related work.</li></ul><br/>If you want to work in a creative and exciting area and if you want to be part of a cutting-edge, scientific project, join us today!<br/><br/><strong>Contact:</strong><br/>André Schaller<br/>schaller- AT -seceng.informatik.tu-darmstadt.de<br/><a class=\"postlink\" href=\"http://www.seceng.de/schaller\">http://www.seceng.de/schaller</a><br/><br/><strong>Links:</strong><br/>[1] - <!-- m --><a class=\"postlink\" href=\"https://en.wikipedia.org/wiki/Row_hammer\">https://en.wikipedia.org/wiki/Row_hammer</a><!-- m --><br/>[2] - <!-- m --><a class=\"postlink\" href=\"https://www.cosic.esat.kuleuven.be/publications/article-1483.pdf\">https://www.cosic.esat.kuleuven.be/publ ... e-1483.pdf</a><!-- m --><br/>[3] - <!-- m --><a class=\"postlink\" href=\"http://www.pandaboard.org\">http://www.pandaboard.org</a><!-- m --></div>",
                    "body_text": "The Security Engineering Group (http://www.seceng.de) is providing the opportunity to supervise a Bachelor-Thesis or a student assistant (HiWi) position in the field of hardware-based security. The core idea of the project is to implement and evaluate a Physically Unclonable Function instance called the Rowhammer-PUF on embedded systems.The Project:The project is based on prior work of our group on the Rowhammer-PUF. The Rowhammer-PUF is based on the Rowhammer effect existent in most DRAM modules[1]. While being mainly regarded as a critical security issue in the literature, we exploit the Rowhammer effect in a constructive way, in order to extract an instance of a so-called Physically Unclonable Function[2]. The resulting Rowhammer-PUF was already implemented  and evaluated on an embedded platform, the PandaBoard[3] by our group.The project's goal is to develop a Linux kernel module that makes the PUF instance accessible to the Linux kernel.Your Tasks:Your main task is to use our existing implementation, which is done in the bootloader of the PandaBoard, in order to come up with a Linux kernel module of the code. Once this is done, a secondary goal is to use our bootloader-based implementation as well as your developed kernel module, in order to further optimize the implementation to retrieve PUF characteristics of improved quality.Therefore, you will first have to get used to the PandaBoard development platform, learn how to program and flash the board. Next, you will become familiar with our existing code and simultaneously with the corresponding registers of the PandaBoard by reading through the Technical Reference Manual (data sheet) of the board. Once understood the functionality of the existing code, you will port it to a Linux kernel module and test it's functionality. Finally, you will optimize our code as well as your newly developed code towards predefined goals.Your Profil:Your are studying computer science or electrical engineering.You have good experience in programming with c.Your are familiar with (ARM-based) microcontroller programming / bare-metal programming and working with IDEs such as Keil as well as Code Composer Studio.You are in favor of hands-on, hardware-related work.If you want to work in a creative and exciting area and if you want to be part of a cutting-edge, scientific project, join us today!Contact:André Schallerschaller- AT -seceng.informatik.tu-darmstadt.dehttp://www.seceng.de/schallerLinks:[1] - https://en.wikipedia.org/wiki/Row_hammer[2] - https://www.cosic.esat.kuleuven.be/publ ... e-1483.pdf[3] - http://www.pandaboard.org",
                    "date": "Beitragvon an.schall » 17. Feb 2017 10:08",
                    "user": "an.schall"
                }
            ],
            "title": "Bachelor Thesis / HiWi Position: Implementation of the Rowhammer-PUF",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35588&sid=761560cc62e3c239d97418da17f17765",
            "views": "109"
        },
        {
            "answers": "0",
            "date": "15. Feb 2017 10:47",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Background<br/>Remote attestation is an important security mechanism designed to detect software attacks, typically<br/>realized as a challenge‐response protocol. It allows a trusted verifier to capture the state of a piece of<br/>software, before execution, of a (potentially untrusted or malware‐infected) remote device ‐ a prover.<br/>Static attestation only provides assurance of the integrity of the piece of software (the binaries) but does<br/>not verify its execution. More recently, several attestation schemes are proposed to also capture the<br/>dynamic state of a remote device to enable detection of a wide range of runtime attacks. However, all<br/>schemes in literature mainly focus on the different mechanisms at the prover’s side. In their attempts to<br/>reduce the workload on the prover (often a low‐end embedded device), many assumptions are made with<br/>regards to the capabilities of the verifier. In this thesis/HiWi, we aim to investigate and evaluate the<br/>verifier’s end of these schemes to evaluate remote attestation protocols comprehensively.<br/><br/>Tasks<br/>Analyzing the state‐of‐art remote attestation schemes in order to validate their assumptions.<br/>Implementation of the different verifier models for different schemes.<br/>Evaluation and comparison of the different verifier models.<br/><br/>Position<br/> Available immediately<br/> Duration: 6‐months, extendable<br/><br/>Requirements<br/> C, C++ Programming required<br/> Experience with code static and dynamic<br/>analysis<br/> Familiar with cryptographic libraries<br/><br/>Contact<br/>Please send your application (incl. CV and certificate(s)) via email to:<br/><br/>Shaza Zeitouni<br/><!-- e --><a href=\"mailto:Shaza.zeitouni@trust.tu\">Shaza.zeitouni@trust.tu</a><!-- e -->‐darmstadt.de<br/><br/>Ghada Dessouky<br/><!-- e --><a href=\"mailto:Ghada.dessouky@trust.tu\">Ghada.dessouky@trust.tu</a><!-- e -->‐darmstadt.de</div>",
                    "body_text": "BackgroundRemote attestation is an important security mechanism designed to detect software attacks, typicallyrealized as a challenge‐response protocol. It allows a trusted verifier to capture the state of a piece ofsoftware, before execution, of a (potentially untrusted or malware‐infected) remote device ‐ a prover.Static attestation only provides assurance of the integrity of the piece of software (the binaries) but doesnot verify its execution. More recently, several attestation schemes are proposed to also capture thedynamic state of a remote device to enable detection of a wide range of runtime attacks. However, allschemes in literature mainly focus on the different mechanisms at the prover’s side. In their attempts toreduce the workload on the prover (often a low‐end embedded device), many assumptions are made withregards to the capabilities of the verifier. In this thesis/HiWi, we aim to investigate and evaluate theverifier’s end of these schemes to evaluate remote attestation protocols comprehensively.TasksAnalyzing the state‐of‐art remote attestation schemes in order to validate their assumptions.Implementation of the different verifier models for different schemes.Evaluation and comparison of the different verifier models.Position Available immediately Duration: 6‐months, extendableRequirements C, C++ Programming required Experience with code static and dynamicanalysis Familiar with cryptographic librariesContactPlease send your application (incl. CV and certificate(s)) via email to:Shaza ZeitouniShaza.zeitouni@trust.tu‐darmstadt.deGhada DessoukyGhada.dessouky@trust.tu‐darmstadt.de",
                    "date": "Beitragvon aibrahim » 15. Feb 2017 10:47",
                    "user": "aibrahim"
                }
            ],
            "title": "Bachelor Thesis/HiWi Task",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35570&sid=761560cc62e3c239d97418da17f17765",
            "views": "159"
        },
        {
            "answers": "0",
            "date": "Neuester Beitrag",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Hallo allerseits,<br/><br/>ich suche kurzfristig motivierte Studenten.<br/><br/>Ihr würdet euch in die Themen Robotik, Industrie 4.0, optische Mustererkennung uvm. einarbeiten und Studenten bei ihren Abschlussarbeiten unterstützen.<br/><br/>Voraussetzungen sind:<br/>- Spaß an der Programmierung<br/>- Spaß an neuen Themen<br/>- gute Deutsch-Kenntnisse<br/>- Bereitschaft, häufiger an die Lichtwiese zu fahren.<br/><br/>Alle interessierten können sich gerne unter <!-- e --><a href=\"mailto:tantik@dik.tu-darmstadt.de\">tantik@dik.tu-darmstadt.de</a><!-- e --> melden.<br/><br/>Gruß<br/>Erdal</div>",
                    "body_text": "Hallo allerseits,ich suche kurzfristig motivierte Studenten.Ihr würdet euch in die Themen Robotik, Industrie 4.0, optische Mustererkennung uvm. einarbeiten und Studenten bei ihren Abschlussarbeiten unterstützen.Voraussetzungen sind:- Spaß an der Programmierung- Spaß an neuen Themen- gute Deutsch-Kenntnisse- Bereitschaft, häufiger an die Lichtwiese zu fahren.Alle interessierten können sich gerne unter tantik@dik.tu-darmstadt.de melden.GrußErdal",
                    "date": "Beitragvon Erdal » 8. Feb 2017 15:10",
                    "user": "Erdal"
                }
            ],
            "title": "Hiwi: optische Mustererkennung, Robotik, Industrie 4.0",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35511&sid=761560cc62e3c239d97418da17f17765",
            "views": "99"
        },
        {
            "answers": "0",
            "date": "Neuester Beitrag",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Sehr geehrte Damen und Herren, <br/><br/>ich bin ein Student aus Bulgarien aus der Technischen Universität Sofia und mein Name is Evgeni Sabev. Momentan bin ich in meinem letzten Studienjahr (7-tes von 8 Semester). Es geht darum, dass ich meine Bachelorarbeit in Deutschland schreiben möchte, ich suche ein Unternehmen in dem ich das absolvieren könnte oder in der TU Darmstadt direkt. Mein Thema für die Bachelorarbeit lautet: Application of the intelligent methods for information and network security in Industry 4.0(Das Thema steht noch nicht 100% fest, aber soll für Network and Software security in Industrie 4.0 sein). <br/><br/>Mit freundlichen Grüßen <br/>Evgeni Sabev<br/><br/>Contacts: <br/>evgeni.sabev[at]/<br/>gmail[dot]com</div>",
                    "body_text": "Sehr geehrte Damen und Herren, ich bin ein Student aus Bulgarien aus der Technischen Universität Sofia und mein Name is Evgeni Sabev. Momentan bin ich in meinem letzten Studienjahr (7-tes von 8 Semester). Es geht darum, dass ich meine Bachelorarbeit in Deutschland schreiben möchte, ich suche ein Unternehmen in dem ich das absolvieren könnte oder in der TU Darmstadt direkt. Mein Thema für die Bachelorarbeit lautet: Application of the intelligent methods for information and network security in Industry 4.0(Das Thema steht noch nicht 100% fest, aber soll für Network and Software security in Industrie 4.0 sein). Mit freundlichen Grüßen Evgeni SabevContacts: evgeni.sabev[at]/gmail[dot]com",
                    "date": "Beitragvon evgeni_bg » 6. Feb 2017 23:06",
                    "user": "evgeni_bg"
                }
            ],
            "title": "Bachelorarbeit",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35501&sid=761560cc62e3c239d97418da17f17765",
            "views": "146"
        },
        {
            "answers": "0",
            "date": "30. Jan 2017 17:08",
            "thread": [
                {
                    "body_html": "<div class=\"content\"><strong>Description: </strong><br/><br/>Named data networking has emerged as a future Internet paradigm and provides data centric capabilities like naming scheme and caching mechanisms. There has been an emergence of a number of content distribution and context-aware applications for video streaming and the Internet-of-Things (IoT), proposed in NDN. But user movement and the dynamic nature of a distributed environment brings in challenges such as resource constraints and uncontrolled mobility. Also, the real-time distribution of content with low latency is an important characteristic for modern networks. In such a case, complex event processing (CEP) offers a medium to obtain contextual information with high performance by deploying operator graphs among the nodes. But the placement of the operators and migration of the same in such a dynamic<br/>environment are still some open questions.<br/>If this topic* interests you, please get in touch with anyone of us.  <br/><br/><strong>Main Tasks:</strong><br/><br/>- Literature research on operator placement and migrations algorithms in CEP.<br/>- Design of an appropriate naming scheme in NDN for context-aware applications using CEP.<br/>- Design of efficient event caching mechanisms depending on application needs.<br/>- Design of necessary access policies and selective interest/data forwarding schemes  <br/><br/><strong>Skills Required:</strong><br/><br/>- Interest in communication networks and event based systems.<br/>- Good programming skills in C++ and/or Python.  <br/><br/>Starting date: As soon as possible; Duration of 3-6 months (depending on your study programme)  <br/><br/>* A detailed topic for the thesis shall be finalized after face-to-face discussions.</div>",
                    "body_text": "Description: Named data networking has emerged as a future Internet paradigm and provides data centric capabilities like naming scheme and caching mechanisms. There has been an emergence of a number of content distribution and context-aware applications for video streaming and the Internet-of-Things (IoT), proposed in NDN. But user movement and the dynamic nature of a distributed environment brings in challenges such as resource constraints and uncontrolled mobility. Also, the real-time distribution of content with low latency is an important characteristic for modern networks. In such a case, complex event processing (CEP) offers a medium to obtain contextual information with high performance by deploying operator graphs among the nodes. But the placement of the operators and migration of the same in such a dynamicenvironment are still some open questions.If this topic* interests you, please get in touch with anyone of us.  Main Tasks:- Literature research on operator placement and migrations algorithms in CEP.- Design of an appropriate naming scheme in NDN for context-aware applications using CEP.- Design of efficient event caching mechanisms depending on application needs.- Design of necessary access policies and selective interest/data forwarding schemes  Skills Required:- Interest in communication networks and event based systems.- Good programming skills in C++ and/or Python.  Starting date: As soon as possible; Duration of 3-6 months (depending on your study programme)  * A detailed topic for the thesis shall be finalized after face-to-face discussions.",
                    "date": "Beitragvon manisha.luthra » 30. Jan 2017 17:08",
                    "user": "manisha.luthra"
                }
            ],
            "title": "Bachelor / Master Thesis: Distributed Complex Event Processing in Named-Data Networks",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35444&sid=761560cc62e3c239d97418da17f17765",
            "views": "217"
        },
        {
            "answers": "0",
            "date": "30. Jan 2017 11:57",
            "thread": [
                {
                    "body_html": "<div class=\"content\">The <em>Engineering Cryptographic Protocols Group</em> (<a class=\"postlink\" href=\"http://encrypto.de\">ENCRYPTO</a>) together with the <em>Computational Biology and Simulation Group</em> (<a class=\"postlink\" href=\"http://www.kay-hamacher.de\">CBS</a>) is offering a master thesis on \"<strong>Large-Scale Privacy-Preserving Statistical Computations for Distributed Genome-Wide Association Studies in ABY</strong>\".<br/><br/><strong>Motivation</strong><br/><em>Secure Multi-Party Computation</em> (SMPC) allows multiple parties to compute a publicly known function while keeping their inputs private. This privacy property is desirable, e.g., in the context of distributed <em>Genome-Wide Association Studies</em> (GWAS). In GWAS, researchers try to find associations between variations in genomes and traits (e.g. diseases) by computing certain statistics on sequenced genome data of case and control groups. Since genome sequencing is still comparatively expensive and meaningful GWAS results require large participant groups, it is reasonable for research institutes to collaborate and share their data sets for this purpose. However, participants do not want their genome data to be given out of hand, since data leakage could lead, for example, to discrimination by health insurance companies.<br/><br/>In the past there have been several efforts to employ SMPC techniques for privacy-preserving GWAS computations (e.g. [1]), mostly as part of the yearly <a class=\"postlink\" href=\"http://humangenomeprivacy.org\">iDash</a> competition. However, none of them are satisfying: they employ outdated frameworks for their implementations, evaluate performance using very small input data sets, consider only the two party case (i.e. only two research institutes collaborate), and do not take into account several practically relevant statistics.<br/><br/><strong>Goal</strong><br/>The goal of this thesis is to implement statistical computations for GWAS (e.g. <span class=\"MathJaxBB\"><span class=\"MathJax_Preview\">[math]</span><span class=\"math/tex\" style=\"visibility: hidden;\">\\chi^2</span></span>-, <span class=\"MathJaxBB\"><span class=\"MathJax_Preview\">[math]</span><span class=\"math/tex\" style=\"visibility: hidden;\">p</span></span>-, <span class=\"MathJaxBB\"><span class=\"MathJax_Preview\">[math]</span><span class=\"math/tex\" style=\"visibility: hidden;\">g</span></span>-, and <span class=\"MathJaxBB\"><span class=\"MathJax_Preview\">[math]</span><span class=\"math/tex\" style=\"visibility: hidden;\">\\textit{KS}</span></span>-tests) in <a class=\"postlink\" href=\"https://github.com/encryptogroup/ABY\">ABY</a>, a widely used state-of-the-art framework for compiling function descriptions into highly efficient privacy-preserving protocols. The framework additionally provides the possibility to combine different SMPC schemes within a single protocol, a feature that should be thoroughly investigated in order to maximize the efficiency of the resulting protocols. Furthermore, an outsourcing scenario should be considered where multiple research institutes securely share their inputs with a small amount of servers that together execute the generated SMPC protocols and return the results. Finally, the performance of the implementation should be evaluated by first comparing it to previous works and then testing scalability using large input data sets.<br/><br/><strong>Requirements</strong><br/><ul><li> Good programming skills in C/C++</li><li> At least basic knowledge of cryptography and statistics</li><li> High motivation + ability to work independently</li><li> Knowledge of the English language, Git, <span class=\"MathJaxBB\"><span class=\"MathJax_Preview\">[math]</span><span class=\"math/tex\" style=\"visibility: hidden;\">\\LaTeX</span></span>, etc. goes without saying</li></ul><strong>References</strong><br/>[1] Scott D. Constable, Yuzhe Tang, Shuang Wang, Xiaoqian Jiang, and Steve Chapin. Privacy-preserving GWAS analysis on federated genomic datasets. <em>BMC Medical Informatics and Decision Making</em>, 15, 2015.<br/><br/>For contact details see attached.<br/><div class=\"inline-attachment\">\n<dl class=\"file\">\n<dt><span class=\"imageset icon_topic_attach\"></span> <a class=\"postlink\" href=\"./download/file.php?id=1963\">MT_Large-Scale_Privacy-Preserving_Statistical_Computations_for_Distributed_GWAS_in_ABY.pdf</a></dt>\n<dd>(88.03 KiB) 18-mal heruntergeladen</dd>\n</dl>\n</div></div>",
                    "body_text": "The Engineering Cryptographic Protocols Group (ENCRYPTO) together with the Computational Biology and Simulation Group (CBS) is offering a master thesis on \"Large-Scale Privacy-Preserving Statistical Computations for Distributed Genome-Wide Association Studies in ABY\".MotivationSecure Multi-Party Computation (SMPC) allows multiple parties to compute a publicly known function while keeping their inputs private. This privacy property is desirable, e.g., in the context of distributed Genome-Wide Association Studies (GWAS). In GWAS, researchers try to find associations between variations in genomes and traits (e.g. diseases) by computing certain statistics on sequenced genome data of case and control groups. Since genome sequencing is still comparatively expensive and meaningful GWAS results require large participant groups, it is reasonable for research institutes to collaborate and share their data sets for this purpose. However, participants do not want their genome data to be given out of hand, since data leakage could lead, for example, to discrimination by health insurance companies.In the past there have been several efforts to employ SMPC techniques for privacy-preserving GWAS computations (e.g. [1]), mostly as part of the yearly iDash competition. However, none of them are satisfying: they employ outdated frameworks for their implementations, evaluate performance using very small input data sets, consider only the two party case (i.e. only two research institutes collaborate), and do not take into account several practically relevant statistics.GoalThe goal of this thesis is to implement statistical computations for GWAS (e.g. [math]\\chi^2-, [math]p-, [math]g-, and [math]\\textit{KS}-tests) in ABY, a widely used state-of-the-art framework for compiling function descriptions into highly efficient privacy-preserving protocols. The framework additionally provides the possibility to combine different SMPC schemes within a single protocol, a feature that should be thoroughly investigated in order to maximize the efficiency of the resulting protocols. Furthermore, an outsourcing scenario should be considered where multiple research institutes securely share their inputs with a small amount of servers that together execute the generated SMPC protocols and return the results. Finally, the performance of the implementation should be evaluated by first comparing it to previous works and then testing scalability using large input data sets.Requirements Good programming skills in C/C++ At least basic knowledge of cryptography and statistics High motivation + ability to work independently Knowledge of the English language, Git, [math]\\LaTeX, etc. goes without sayingReferences[1] Scott D. Constable, Yuzhe Tang, Shuang Wang, Xiaoqian Jiang, and Steve Chapin. Privacy-preserving GWAS analysis on federated genomic datasets. BMC Medical Informatics and Decision Making, 15, 2015.For contact details see attached.\n\n MT_Large-Scale_Privacy-Preserving_Statistical_Computations_for_Distributed_GWAS_in_ABY.pdf\n(88.03 KiB) 18-mal heruntergeladen",
                    "date": "Beitragvon cwb38 » 30. Jan 2017 11:57",
                    "user": "cwb38"
                }
            ],
            "title": "[MT] Large-Scale Privacy-Preserving Statistical Computations for Distributed Genome-Wide Association Studies in ABY",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35441&sid=761560cc62e3c239d97418da17f17765",
            "views": "191"
        },
        {
            "answers": "0",
            "date": "Neuester Beitrag",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Hallo,<br/><br/>wir suchen zur Zeit zu folgenden Themen Absolventen, die gerne mit uns zusammen ihre Abschlussarbeit angehen möchten.<br/><br/>Zum einen geht es um das Thema:<br/>1)\tImplementierung eines OPC UA Interfaces für Inspektionsanlagen<br/>Zum anderen um:<br/>2)\tImplementierung einer Oberfläche für Inspektionsanlagen<br/><br/>Genaue Informationen finden Sie unter: <a class=\"postlink\" href=\"http://ramgmbh.de/Karriere-Jobs-Stellenangebote\">http://ramgmbh.de/Karriere-Jobs-Stellenangebote</a><br/><br/>Bei Fragen dürfen Sie sich vertrauensvoll an mich wenden:<br/>MfG<br/>Th. Weidenfeller / <!-- e --><a href=\"mailto:tweidenfeller@ramgmbh.de\">tweidenfeller@ramgmbh.de</a><!-- e --></div>",
                    "body_text": "Hallo,wir suchen zur Zeit zu folgenden Themen Absolventen, die gerne mit uns zusammen ihre Abschlussarbeit angehen möchten.Zum einen geht es um das Thema:1)\tImplementierung eines OPC UA Interfaces für InspektionsanlagenZum anderen um:2)\tImplementierung einer Oberfläche für InspektionsanlagenGenaue Informationen finden Sie unter: http://ramgmbh.de/Karriere-Jobs-StellenangeboteBei Fragen dürfen Sie sich vertrauensvoll an mich wenden:MfGTh. Weidenfeller / tweidenfeller@ramgmbh.de",
                    "date": "Beitragvon R.A.M. GmbH » 25. Jan 2017 11:03",
                    "user": "R.A.M. GmbH"
                }
            ],
            "title": "Abschlussarbeit Diplom/Master",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35424&sid=761560cc62e3c239d97418da17f17765",
            "views": "175"
        },
        {
            "answers": "0",
            "date": "Neuester Beitrag",
            "thread": [
                {
                    "body_html": "<div class=\"content\">GetSafe ist ein junges und innovatives Fintech Start-Up mit Sitz in Heidelberg. Wir arbeiten an einer Vision: Millionen von Menschen dabei helfen ihre Finanzen und Versicherungen besser zu managen. Als erstes Produkt bietet GetSafe eine zentrale, digitale Lösung zur Verwaltung der eigenen Versicherungen. Die App schafft eine Übersicht bestehender Verträge, hilft bei der Optimierung des Versicherungsbestands und bietet einen flexiblen Service durch geprüfte Experten. Unterstützt und finanziert wird unser Unternehmen u.a. von namhaften Investoren wie Rocket Internet sowie den Gründern von Check24 und Interhyp.<br/><br/>Dich reizt es, einen wesentlichen Beitrag für ein Start-Up, welches eine Vorreiterposition in Deutschland eingenommen hat, zu leisten? Du willst dich aktiv in einem sehr dynamischen, jungen Team in einer der schönsten Städte Deutschlands einbringen? <br/><br/>Schreibe eine Bachelor- / Master- oder Praxisarbeit bei uns! - Wir betreuen deine Arbeit gerne! Setze dich zur ersten Absprache mit uns in Verbindung oder stelle uns auch gerne bereits deine konkreten Idee vor. Deine Ansprechpartnerin bei GetSafe ist Jelena Bjelonic (<!-- e --><a href=\"mailto:jobs@getsafe.de\">jobs@getsafe.de</a><!-- e -->).</div>",
                    "body_text": "GetSafe ist ein junges und innovatives Fintech Start-Up mit Sitz in Heidelberg. Wir arbeiten an einer Vision: Millionen von Menschen dabei helfen ihre Finanzen und Versicherungen besser zu managen. Als erstes Produkt bietet GetSafe eine zentrale, digitale Lösung zur Verwaltung der eigenen Versicherungen. Die App schafft eine Übersicht bestehender Verträge, hilft bei der Optimierung des Versicherungsbestands und bietet einen flexiblen Service durch geprüfte Experten. Unterstützt und finanziert wird unser Unternehmen u.a. von namhaften Investoren wie Rocket Internet sowie den Gründern von Check24 und Interhyp.Dich reizt es, einen wesentlichen Beitrag für ein Start-Up, welches eine Vorreiterposition in Deutschland eingenommen hat, zu leisten? Du willst dich aktiv in einem sehr dynamischen, jungen Team in einer der schönsten Städte Deutschlands einbringen? Schreibe eine Bachelor- / Master- oder Praxisarbeit bei uns! - Wir betreuen deine Arbeit gerne! Setze dich zur ersten Absprache mit uns in Verbindung oder stelle uns auch gerne bereits deine konkreten Idee vor. Deine Ansprechpartnerin bei GetSafe ist Jelena Bjelonic (jobs@getsafe.de).",
                    "date": "Beitragvon Viola@GetSafe » 12. Jan 2017 12:13",
                    "user": "Viola@GetSafe"
                }
            ],
            "title": "Deine Abschlussarbeit - ein Nutzen für dich und uns!",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35362&sid=761560cc62e3c239d97418da17f17765",
            "views": "213"
        },
        {
            "answers": "0",
            "date": "10. Jan 2017 14:38",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Hallo zusammen, <br/>Im Fachgebiet Telekooperation ist ab sofort eine Bachelor- oder Masterarbeit zu vergeben, die sich mit Scheduling-Strategien für das Stream-Processing Framework Apache Storm beschäftigen soll.Details hierzu bitte siehe angehängtes PDF.<br/>Wenn ihr an der Arbeit Interesse habt, würde ich mich freuen, von euch zu hören.<br/>Gruß,<br/>Julien<br/>------------------------------------<br/>Kontakt bei Interesse:<br/>Julien Gedeon / Raum A124<br/><!-- e --><a href=\"mailto:gedeon@tk.tu-darmstadt.de\">gedeon@tk.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Hallo zusammen, Im Fachgebiet Telekooperation ist ab sofort eine Bachelor- oder Masterarbeit zu vergeben, die sich mit Scheduling-Strategien für das Stream-Processing Framework Apache Storm beschäftigen soll.Details hierzu bitte siehe angehängtes PDF.Wenn ihr an der Arbeit Interesse habt, würde ich mich freuen, von euch zu hören.Gruß,Julien------------------------------------Kontakt bei Interesse:Julien Gedeon / Raum A124gedeon@tk.tu-darmstadt.de",
                    "date": "Beitragvon julien » 10. Jan 2017 14:38",
                    "user": "julien"
                }
            ],
            "title": "Bachelor-/Masterarbeit: Scheduling-Strategien für Apache Storm",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35352&sid=761560cc62e3c239d97418da17f17765",
            "views": "354"
        },
        {
            "answers": "0",
            "date": "15. Dez 2016 15:12",
            "thread": [
                {
                    "body_html": "<div class=\"content\">The <em>Engineering Cryptographic Protocols Group</em> (<a class=\"postlink\" href=\"http://encrypto.de\">ENCRYPTO</a>) is offering a bachelor thesis on \"<strong>Implementing Integer / IEEE 754 Floating Point Conversion Gates for the ABY Framework in the Context of Genome-Wide Association Studies</strong>\".<br/><br/><strong>Motivation</strong><br/><em>Secure Multi-Party Computation</em> (SMPC) allows multiple parties to compute a publicly known function while keeping their inputs private. This privacy property is desirable, e.g., in the context of distributed <em>Genome-Wide Association Studies</em> (GWAS). In GWAS, researchers try to find associations between variations in genomes and traits (e.g. diseases) by computing certain statistics on sequenced genome data of case and control groups. Since genome sequencing is still comparatively expensive and meaningful GWAS results require large participant groups, it is reasonable for research institutes to collaborate and share their data sets for this purpose. However, participants do not want their genome data to be given out of hand, since data leakage could lead, for example, to discrimination by health insurance companies.<br/><br/><a class=\"postlink\" href=\"https://github.com/encryptogroup/ABY\">ABY</a> is a widely used framework for compiling function descriptions into highly efficient privacy-preserving protocols in the SMPC special case of only two parties. Therefore, it could be employed to create protocols for securely computing the statistics needed for GWAS conducted by two collaborating research institutes. Using the framework, functions can be described as circuits by plugging together different kind of high-level gates (e.g. ADD and MUL) that operate on encrypted or secret shared input data. There exist arithmetic gates for integer and IEEE 754 floating point input values. However, currently only one type of gate can be used throughout a computation, i.e. for integer inputs only integer operations and likewise for floating point inputs only floating point operations can be performed. This is not desirable in cases where floating point operations on integer inputs are only necessary in the final parts of a computation since the complexity of floating point gates leads to much higher run-times.<br/><br/><strong>Goal</strong><br/>The goal of this thesis is to implement conversion gates for the ABY framework s.t. it is possible to convert between integer and IEEE 754 floating point values. The implementation should be evaluated in practical application scenarios, e.g. when calculating the <em>Minor Allele Frequency</em> (MAF) and the <span class=\"MathJaxBB\"><span class=\"MathJax_Preview\">[math]</span><span class=\"math/tex\" style=\"visibility: hidden;\">\\chi^2</span></span>-test in the context of two-party GWAS.<br/><br/><strong>Requirements</strong><br/><ul><li> Good programming skills in C/C++</li><li> At least basic knowledge of cryptography</li><li> High motivation + ability to work independently</li><li> Knowledge of the English language, Git, <span class=\"MathJaxBB\"><span class=\"MathJax_Preview\">[math]</span><span class=\"math/tex\" style=\"visibility: hidden;\">\\LaTeX</span></span>, etc. goes without saying</li></ul>For contact details see attached.<br/><div class=\"inline-attachment\">\n<dl class=\"file\">\n<dt><span class=\"imageset icon_topic_attach\"></span> <a class=\"postlink\" href=\"./download/file.php?id=1951\">BT_Implementing_Conversion_Gates_ABY_GWAS.pdf</a></dt>\n<dd>(78.01 KiB) 12-mal heruntergeladen</dd>\n</dl>\n</div></div>",
                    "body_text": "The Engineering Cryptographic Protocols Group (ENCRYPTO) is offering a bachelor thesis on \"Implementing Integer / IEEE 754 Floating Point Conversion Gates for the ABY Framework in the Context of Genome-Wide Association Studies\".MotivationSecure Multi-Party Computation (SMPC) allows multiple parties to compute a publicly known function while keeping their inputs private. This privacy property is desirable, e.g., in the context of distributed Genome-Wide Association Studies (GWAS). In GWAS, researchers try to find associations between variations in genomes and traits (e.g. diseases) by computing certain statistics on sequenced genome data of case and control groups. Since genome sequencing is still comparatively expensive and meaningful GWAS results require large participant groups, it is reasonable for research institutes to collaborate and share their data sets for this purpose. However, participants do not want their genome data to be given out of hand, since data leakage could lead, for example, to discrimination by health insurance companies.ABY is a widely used framework for compiling function descriptions into highly efficient privacy-preserving protocols in the SMPC special case of only two parties. Therefore, it could be employed to create protocols for securely computing the statistics needed for GWAS conducted by two collaborating research institutes. Using the framework, functions can be described as circuits by plugging together different kind of high-level gates (e.g. ADD and MUL) that operate on encrypted or secret shared input data. There exist arithmetic gates for integer and IEEE 754 floating point input values. However, currently only one type of gate can be used throughout a computation, i.e. for integer inputs only integer operations and likewise for floating point inputs only floating point operations can be performed. This is not desirable in cases where floating point operations on integer inputs are only necessary in the final parts of a computation since the complexity of floating point gates leads to much higher run-times.GoalThe goal of this thesis is to implement conversion gates for the ABY framework s.t. it is possible to convert between integer and IEEE 754 floating point values. The implementation should be evaluated in practical application scenarios, e.g. when calculating the Minor Allele Frequency (MAF) and the [math]\\chi^2-test in the context of two-party GWAS.Requirements Good programming skills in C/C++ At least basic knowledge of cryptography High motivation + ability to work independently Knowledge of the English language, Git, [math]\\LaTeX, etc. goes without sayingFor contact details see attached.\n\n BT_Implementing_Conversion_Gates_ABY_GWAS.pdf\n(78.01 KiB) 12-mal heruntergeladen",
                    "date": "Beitragvon cwb38 » 15. Dez 2016 15:12",
                    "user": "cwb38"
                }
            ],
            "title": "[BT] Implementing Integer / IEEE 754 Floating Point Conversion Gates for the ABY Framework in the Context of GWAS",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35282&sid=761560cc62e3c239d97418da17f17765",
            "views": "315"
        },
        {
            "answers": "0",
            "date": "15. Dez 2016 10:09",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Topic Description<br/>The current standard for high-quality video distribution on the Internet is DASH. It allows accounting for varying bandwidth<br/>conditions inherent to the Internet, by breaking down videos in segments of different quality representations that can be<br/>accessed by clients. Currently, DASH relies on transmission using HTTP over TCP/IP networks, imposing limitations for current<br/>increasingly dynamic and mobile use cases for video streaming, given the static, host bound nature of such networks.<br/>Here, Named Data Networks (NDN) promises significant advantages by decoupling data objects from hosts. Thus, providing<br/>higher resilience for mobile and dynamic use cases by design in relieving clients from finding which hosts provide the required<br/>data and providing such functionalities by design in the network.<br/><br/>In this new research area lies potential much potential for novel work and we want to encourage you to get in touch with us if<br/>you are interested in the offered master thesis project described below<br/><br/>Skill Requirements:<br/>- Interest in communication networks<br/>- Good programming skills in C++ or Python<br/><br/>Contact either of us:<br/>Manisha Luthra<br/><!-- e --><a href=\"mailto:manisha.luthra@kom.tu-darmstadt.de\">manisha.luthra@kom.tu-darmstadt.de</a><!-- e --><br/><br/>Denny Stohr<br/><!-- e --><a href=\"mailto:dstohr@kom.tu-darmstadt.de\">dstohr@kom.tu-darmstadt.de</a><!-- e --><br/><br/>For more details see attached.</div>",
                    "body_text": "Topic DescriptionThe current standard for high-quality video distribution on the Internet is DASH. It allows accounting for varying bandwidthconditions inherent to the Internet, by breaking down videos in segments of different quality representations that can beaccessed by clients. Currently, DASH relies on transmission using HTTP over TCP/IP networks, imposing limitations for currentincreasingly dynamic and mobile use cases for video streaming, given the static, host bound nature of such networks.Here, Named Data Networks (NDN) promises significant advantages by decoupling data objects from hosts. Thus, providinghigher resilience for mobile and dynamic use cases by design in relieving clients from finding which hosts provide the requireddata and providing such functionalities by design in the network.In this new research area lies potential much potential for novel work and we want to encourage you to get in touch with us ifyou are interested in the offered master thesis project described belowSkill Requirements:- Interest in communication networks- Good programming skills in C++ or PythonContact either of us:Manisha Luthramanisha.luthra@kom.tu-darmstadt.deDenny Stohrdstohr@kom.tu-darmstadt.deFor more details see attached.",
                    "date": "Beitragvon manisha.luthra » 15. Dez 2016 10:09",
                    "user": "manisha.luthra"
                }
            ],
            "title": "Bachelor/Master Thesis: Named-Data-Network (NDN, ICN) for DASH Streaming",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35281&sid=761560cc62e3c239d97418da17f17765",
            "views": "348"
        },
        {
            "answers": "0",
            "date": "12. Dez 2016 13:07",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Im Fachgebiet Telekooperation ist ab sofort eine Bachelor- oder Masterarbeit zu vergeben, in der es um Kommunikationspattern (u.a Publish/Subscribe) in dynamischen urbanen Netzwerken geht.<br/>Details hierzu bitte siehe angehängtes PDF.<br/><br/>Kontakt bei Interesse:<br/>Julien Gedeon / Raum A124<br/><!-- e --><a href=\"mailto:gedeon@tk.tu-darmstadt.de\">gedeon@tk.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Im Fachgebiet Telekooperation ist ab sofort eine Bachelor- oder Masterarbeit zu vergeben, in der es um Kommunikationspattern (u.a Publish/Subscribe) in dynamischen urbanen Netzwerken geht.Details hierzu bitte siehe angehängtes PDF.Kontakt bei Interesse:Julien Gedeon / Raum A124gedeon@tk.tu-darmstadt.de",
                    "date": "Beitragvon julien » 12. Dez 2016 13:07",
                    "user": "julien"
                }
            ],
            "title": "Bachelor-/Masterarbeit: Publish/Subscribe in dynamischen urbanen Netzen",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35268&sid=761560cc62e3c239d97418da17f17765",
            "views": "400"
        },
        {
            "answers": "0",
            "date": "30. Nov 2016 09:09",
            "thread": [
                {
                    "body_html": "<div class=\"content\"><strong>Thema</strong> <br/>Multicast in eine vielfach von Internetanbietern eingesetzte Datenübertragungstechnik. Anbieter wie die Deutsche Telekom oder AT&amp;T in den USA nutzen Multicast, um ihre IPTV-Kanäle, z.B. T-Entertain innerhalb ihres Netzes zu verteilen. Für Video-on-Demand-Dienste, wie YouTube oder die ZDF-Mediathek konnte Multicast bisher nicht eingesetzt werden, da hier die Wiedergabeposition des Videos für jeden Nutzer individuell ist. Zudem ist die große Anzahl an verfügbaren Videos um ein Vielfaches größer als die Anzahl an IPTV-Kanälen.  <br/><br/><strong>Aufgabe</strong><br/>Es wurde bereits gezeigt, dass auch in VoD(Video on Demand)-Szenarien, Multicast dazu beitragen kann den Datenverkehr in Providernetzen erheblich zu reduzieren. Dazu wurde an unserem Lehrstuhl ein Prototyp entwickel. In dieser Abschlussarbeit soll das Potential Machine Learning zur Optimierung des bisher sehr nativen Auswahlverfahrens für geeignete Videos, die über Multicast ausgeliefert werden, untersucht werden. Das derzeitige Verfahren wählt die 10% populärsten Videos der letzten 30 Minuten aus. Damit konnten bereits gute Ergebnisse erzielt werden, jedoch ist das Verfahren sehr einfach und vergangenheitsgerichtet. <br/>Eine Möglichkeit dies zu verbessern, sind prädiktive Verfahren aus dem Bereich des Maschinellen Lernens, welche in dieser Arbeit vorgeschlagen, implementiert und ausgewertet werden sollen. <br/>Weitere Fragen zu Code, Daten und ersten Ideen würde ich sehr gern im persönlichen Gespräch austauschen. Je nachdem, ob eine Bachelor- oder Masterarbeit angestrebt ist, kann der Umfang der Arbeit angepasst werden.<br/><br/><strong>Kenntnisse</strong><br/>- Erfahrung mit / Motivation für C++-Entwicklung<br/>- Interesse an Machine Learning<br/><br/><strong>Was wir bieten</strong><br/>- Regelmäßige Treffen und Betreuung<br/>- Auf Wunsch einen Arbeitsplatz vor Ort<br/>- Server zum Ausführen von Code<br/><br/><strong>Kontakt</strong> <br/>Christian Koch, M.Sc.<br/><!-- e --><a href=\"mailto:ckoch@ps.tu-darmstadt.de\">ckoch@ps.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Thema Multicast in eine vielfach von Internetanbietern eingesetzte Datenübertragungstechnik. Anbieter wie die Deutsche Telekom oder AT&T in den USA nutzen Multicast, um ihre IPTV-Kanäle, z.B. T-Entertain innerhalb ihres Netzes zu verteilen. Für Video-on-Demand-Dienste, wie YouTube oder die ZDF-Mediathek konnte Multicast bisher nicht eingesetzt werden, da hier die Wiedergabeposition des Videos für jeden Nutzer individuell ist. Zudem ist die große Anzahl an verfügbaren Videos um ein Vielfaches größer als die Anzahl an IPTV-Kanälen.  AufgabeEs wurde bereits gezeigt, dass auch in VoD(Video on Demand)-Szenarien, Multicast dazu beitragen kann den Datenverkehr in Providernetzen erheblich zu reduzieren. Dazu wurde an unserem Lehrstuhl ein Prototyp entwickel. In dieser Abschlussarbeit soll das Potential Machine Learning zur Optimierung des bisher sehr nativen Auswahlverfahrens für geeignete Videos, die über Multicast ausgeliefert werden, untersucht werden. Das derzeitige Verfahren wählt die 10% populärsten Videos der letzten 30 Minuten aus. Damit konnten bereits gute Ergebnisse erzielt werden, jedoch ist das Verfahren sehr einfach und vergangenheitsgerichtet. Eine Möglichkeit dies zu verbessern, sind prädiktive Verfahren aus dem Bereich des Maschinellen Lernens, welche in dieser Arbeit vorgeschlagen, implementiert und ausgewertet werden sollen. Weitere Fragen zu Code, Daten und ersten Ideen würde ich sehr gern im persönlichen Gespräch austauschen. Je nachdem, ob eine Bachelor- oder Masterarbeit angestrebt ist, kann der Umfang der Arbeit angepasst werden.Kenntnisse- Erfahrung mit / Motivation für C++-Entwicklung- Interesse an Machine LearningWas wir bieten- Regelmäßige Treffen und Betreuung- Auf Wunsch einen Arbeitsplatz vor Ort- Server zum Ausführen von CodeKontakt Christian Koch, M.Sc.ckoch@ps.tu-darmstadt.de",
                    "date": "Beitragvon ckoch » 30. Nov 2016 09:09",
                    "user": "ckoch"
                }
            ],
            "title": "Video Multicast mit Machine Learning Optimieren",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35218&sid=761560cc62e3c239d97418da17f17765",
            "views": "256"
        },
        {
            "answers": "0",
            "date": "18. Nov 2016 19:06",
            "thread": [
                {
                    "body_html": "<div class=\"content\"><strong>Announcement withdrawn; a suitable candidate has been found</strong><br/><br/><br/>I would like to supervise the following topic, start as soon as possible:<br/><br/>In modern education students need to focus on passing the exams. After finals, a new term starts and students put away old books to give space to new ones. They have no time nor encouragement to stay engaged with former subjects. As times goes by memory fades, and as time goes by a little further, students must remember about those subjects for new lectures or work. This problem is so human that people look at it as inevitable. TU Darmstadt wants to implement a simple solution: engage students with former lectures.<br/><br/>The idea is to make engagement with former lectures fun and accessible. We want to do it by bringing the popularity from quiz games and accessibility from mobile apps together with the academic knowledge students have. For that we need to create a quiz app, in which students can challenge each other to matches, answering questions from former subjects.<br/><br/>To play, students will create a personal account, giving information such as the course they are taking and the subjects they have already covered. This way the app can select the players that have enough common knowledge to play together. The game will follow the same pattern that has made other quiz games successful. The first player chooses a subject from the x subjects in common with the second player and answers the first roll of questions. The other player must answer the same questions before choosing the next subject and so on. At the end the player with most correct answers wins. The App should be able to gather useful information that could be used by professors.<br/><br/>If you are interested, please contact me via <!-- e --><a href=\"mailto:weihe@cs.tu-darmstadt.de\">weihe@cs.tu-darmstadt.de</a><!-- e -->, thanks!<br/><br/>KW</div>",
                    "body_text": "Announcement withdrawn; a suitable candidate has been foundI would like to supervise the following topic, start as soon as possible:In modern education students need to focus on passing the exams. After finals, a new term starts and students put away old books to give space to new ones. They have no time nor encouragement to stay engaged with former subjects. As times goes by memory fades, and as time goes by a little further, students must remember about those subjects for new lectures or work. This problem is so human that people look at it as inevitable. TU Darmstadt wants to implement a simple solution: engage students with former lectures.The idea is to make engagement with former lectures fun and accessible. We want to do it by bringing the popularity from quiz games and accessibility from mobile apps together with the academic knowledge students have. For that we need to create a quiz app, in which students can challenge each other to matches, answering questions from former subjects.To play, students will create a personal account, giving information such as the course they are taking and the subjects they have already covered. This way the app can select the players that have enough common knowledge to play together. The game will follow the same pattern that has made other quiz games successful. The first player chooses a subject from the x subjects in common with the second player and answers the first roll of questions. The other player must answer the same questions before choosing the next subject and so on. At the end the player with most correct answers wins. The App should be able to gather useful information that could be used by professors.If you are interested, please contact me via weihe@cs.tu-darmstadt.de, thanks!KW",
                    "date": "Beitragvon Prof. Karsten Weihe » 18. Nov 2016 19:06",
                    "user": "Prof. Karsten Weihe"
                }
            ],
            "title": "Master Thesis: app programming",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=35165&sid=761560cc62e3c239d97418da17f17765",
            "views": "402"
        },
        {
            "answers": "0",
            "date": "17. Okt 2016 15:48",
            "thread": [
                {
                    "body_html": "<div class=\"content\"><strong>Topic Description</strong><br/><br/>Many services used on the Internet today such as live video streaming, video conferencing, online gaming, and software updates could benefit from multicast functionality in the network. However, IP multicast is generally not available due to missing control and management features. To address this issue, we have proposed a Software-Defined Networking-based (SDN) approach, called Software-Defined Multicast (SDM), that enables ISPs to offer network layer multicast support as a service. SDM enables multicast transport efficiency while keeping unicast packet semantics. One remaining issue is the scalability of multicast forwarding, especially regarding the state required in the network to maintain multicast groups. One approach, called Adaptive Software Defined Multicast (ASDM), has been demonstrated to improve the scalability of groups with small number of members.<br/><br/>However, ASDM has been investigated only in static conditions. Fast changes in the number of groups and users as well as variable traffic conditions have not yet been investigated. Furthermore, the current system is designed to be used under realistic conditions by using only one parameter for configuration. While this approach drastically improves the ease of use, it forgoes optimization potential. The goal of this topic is to expand and extend the current design of ASDM and investigate its dynamic properties.<br/><br/><strong>Objectives</strong><br/><br/><ul> <br/><li> Set up a testbed to evaluate the behavior of multicast systems under highly dynamic conditions</li><li> Optimize the design of ASDM for highly dynamic changes in the number of groups and users e.g. by changing the unicast-conversion threshold at runtime</li><li> Investigate the impact of using a per-group unicast conversion threshold parameter instead of a single global parameter as in the current design</li><li> Investigate multi-tree approaches with multiple unicast conversion threshold</li><li> Handle Flash-Crowds: how to connect as many clients as fast as possible?</li></ul><br/><strong>What we expect</strong><br/><br/><ul><li> Knowledge in the area of network communication (CN1,CN2 or similar)</li><li> Good programming skills in Python and Java or a strong motivation to learn it</li><li> Bonus: Hands on experience with Linux and/or Linux networking</li><li> Bonus: SDN/OpenFlow and NFV knowledge</li></ul><br/><strong>Duration</strong><br/><br/>3-6 Months<br/><br/><strong>Start</strong><br/><br/>at any time<br/><br/><strong>Link to topic homepage</strong> <br/><br/><!-- m --><a class=\"postlink\" href=\"http://www.ps.tu-darmstadt.de/teaching/theses/open/?user%5BshowUid%5D=55&amp;cHash=e61fc26183f361df2e768f3bcf487dd1\">http://www.ps.tu-darmstadt.de/teaching/ ... 3bcf487dd1</a><!-- m --><br/><br/><strong>Contact </strong><br/>Jeremias Blendin, <!-- e --><a href=\"mailto:jblendin@ps.tu-darmstadt.de\">jblendin@ps.tu-darmstadt.de</a><!-- e --><br/><br/>Peer-to-Peer Systems Engineering Lab<br/>Web: <!-- m --><a class=\"postlink\" href=\"http://www.ps.tu-darmstadt.de/\">http://www.ps.tu-darmstadt.de/</a><!-- m --></div>",
                    "body_text": "Topic DescriptionMany services used on the Internet today such as live video streaming, video conferencing, online gaming, and software updates could benefit from multicast functionality in the network. However, IP multicast is generally not available due to missing control and management features. To address this issue, we have proposed a Software-Defined Networking-based (SDN) approach, called Software-Defined Multicast (SDM), that enables ISPs to offer network layer multicast support as a service. SDM enables multicast transport efficiency while keeping unicast packet semantics. One remaining issue is the scalability of multicast forwarding, especially regarding the state required in the network to maintain multicast groups. One approach, called Adaptive Software Defined Multicast (ASDM), has been demonstrated to improve the scalability of groups with small number of members.However, ASDM has been investigated only in static conditions. Fast changes in the number of groups and users as well as variable traffic conditions have not yet been investigated. Furthermore, the current system is designed to be used under realistic conditions by using only one parameter for configuration. While this approach drastically improves the ease of use, it forgoes optimization potential. The goal of this topic is to expand and extend the current design of ASDM and investigate its dynamic properties.Objectives  Set up a testbed to evaluate the behavior of multicast systems under highly dynamic conditions Optimize the design of ASDM for highly dynamic changes in the number of groups and users e.g. by changing the unicast-conversion threshold at runtime Investigate the impact of using a per-group unicast conversion threshold parameter instead of a single global parameter as in the current design Investigate multi-tree approaches with multiple unicast conversion threshold Handle Flash-Crowds: how to connect as many clients as fast as possible?What we expect Knowledge in the area of network communication (CN1,CN2 or similar) Good programming skills in Python and Java or a strong motivation to learn it Bonus: Hands on experience with Linux and/or Linux networking Bonus: SDN/OpenFlow and NFV knowledgeDuration3-6 MonthsStartat any timeLink to topic homepage http://www.ps.tu-darmstadt.de/teaching/ ... 3bcf487dd1Contact Jeremias Blendin, jblendin@ps.tu-darmstadt.dePeer-to-Peer Systems Engineering LabWeb: http://www.ps.tu-darmstadt.de/",
                    "date": "Beitragvon jblendin » 17. Okt 2016 15:48",
                    "user": "jblendin"
                }
            ],
            "title": "Optimizing Adaptive Software Defined Multicast",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34987&sid=761560cc62e3c239d97418da17f17765",
            "views": "166"
        },
        {
            "answers": "0",
            "date": "17. Okt 2016 15:47",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Du magst Python und interessierst dich für Netzwerke? Wir erforschen die Zukunft von Netzwerken und suchen Studenten, die dazu bei tragen wollen. Wir bieten anspruchsvolle Themen im Bereich Software-Defined Networking (SDN) und Network Functions Virtualization (NFV). SDN erlaubt die Steuerung und Verwaltung von Netzwerken in Software. NFV zielt darauf ab Spezialhardware durch Software auf x86 Server zu ersetzen – oder noch knapper formuliert: Internet Service Provider, Carrier und Mobilfunknetze mit Linux betreiben.<br/><br/><strong>Themenbeispiel</strong><br/>Wir wollen das Network Operating System Ryu (<!-- m --><a class=\"postlink\" href=\"http://osrg.github.io/ryu/\">http://osrg.github.io/ryu/</a><!-- m -->) um Virtualisierungsfunktionen erweitern. Ryu wird von NTT Japan verwaltet und ist der Standard für das Prototyping von SDN Applikationen. Es kommt unter anderem in der Forschung beim DE-CIX und der Deutschen Telekom zum Einsatz. Ryu ist in Python implementiert, eventbasiert und setzt auf Eventlets (<!-- m --><a class=\"postlink\" href=\"http://eventlet.net/\">http://eventlet.net/</a><!-- m -->). Ziel des Projekts ist es eine verteilte Version von Ryu zu etnwickeln, in der die einzelnen Ryu Instanzen jeweils die Rolle eines Hypervisors übernehmen.<br/><br/><strong><br/>Voraussetzungen</strong><br/><ul><li> Grundkenntnisse im Bereich Networking, Kenntnisse im Bereich SDN sind von Vorteil (z.B. der Besuch unserer SDN Vorlesung)</li><li> Gute Pythonkenntnisse</li><li> Erste Erfahrungen mit asynchroner Programmierung</li></ul><br/><strong>Wir bieten</strong><br/><ul><li> Intensive Betreuung</li><li> Ein aktuelles Forschungsthema, die Masterarbeit wird in eine Publikation einfliessen</li><li> Mitarbeit an einem Open Source Projekt, Ryu ist der Standard für Prototyping von SDN Applikationen. Ziel der Entwicklung ist es die Virtualisierungsfunktionen in das Ryu Projekt einfliessen zu lassen.</li></ul><br/><strong>Kontakt</strong><br/>Jeremias Blendin, <!-- e --><a href=\"mailto:jblendin@ps.tu-darmstadt.de\">jblendin@ps.tu-darmstadt.de</a><!-- e --><br/><br/>Peer-to-Peer Systems Engineering Lab<br/>Web: <!-- m --><a class=\"postlink\" href=\"http://www.ps.tu-darmstadt.de/\">http://www.ps.tu-darmstadt.de/</a><!-- m --></div>",
                    "body_text": "Du magst Python und interessierst dich für Netzwerke? Wir erforschen die Zukunft von Netzwerken und suchen Studenten, die dazu bei tragen wollen. Wir bieten anspruchsvolle Themen im Bereich Software-Defined Networking (SDN) und Network Functions Virtualization (NFV). SDN erlaubt die Steuerung und Verwaltung von Netzwerken in Software. NFV zielt darauf ab Spezialhardware durch Software auf x86 Server zu ersetzen – oder noch knapper formuliert: Internet Service Provider, Carrier und Mobilfunknetze mit Linux betreiben.ThemenbeispielWir wollen das Network Operating System Ryu (http://osrg.github.io/ryu/) um Virtualisierungsfunktionen erweitern. Ryu wird von NTT Japan verwaltet und ist der Standard für das Prototyping von SDN Applikationen. Es kommt unter anderem in der Forschung beim DE-CIX und der Deutschen Telekom zum Einsatz. Ryu ist in Python implementiert, eventbasiert und setzt auf Eventlets (http://eventlet.net/). Ziel des Projekts ist es eine verteilte Version von Ryu zu etnwickeln, in der die einzelnen Ryu Instanzen jeweils die Rolle eines Hypervisors übernehmen.Voraussetzungen Grundkenntnisse im Bereich Networking, Kenntnisse im Bereich SDN sind von Vorteil (z.B. der Besuch unserer SDN Vorlesung) Gute Pythonkenntnisse Erste Erfahrungen mit asynchroner ProgrammierungWir bieten Intensive Betreuung Ein aktuelles Forschungsthema, die Masterarbeit wird in eine Publikation einfliessen Mitarbeit an einem Open Source Projekt, Ryu ist der Standard für Prototyping von SDN Applikationen. Ziel der Entwicklung ist es die Virtualisierungsfunktionen in das Ryu Projekt einfliessen zu lassen.KontaktJeremias Blendin, jblendin@ps.tu-darmstadt.dePeer-to-Peer Systems Engineering LabWeb: http://www.ps.tu-darmstadt.de/",
                    "date": "Beitragvon jblendin » 17. Okt 2016 15:47",
                    "user": "jblendin"
                }
            ],
            "title": "Bachelor- und Masterarbeiten: Mit Linux und Python Netzwerke erforschen!",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34986&sid=761560cc62e3c239d97418da17f17765",
            "views": "219"
        },
        {
            "answers": "0",
            "date": "12. Okt 2016 14:05",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Beitrag gelöscht</div>",
                    "body_text": "Beitrag gelöscht",
                    "date": "Beitragvon helmi.ben.hmida » 12. Okt 2016 14:05",
                    "user": "helmi.ben.hmida"
                }
            ],
            "title": "Beitrag gelöscht",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34965&sid=761560cc62e3c239d97418da17f17765",
            "views": "183"
        },
        {
            "answers": "0",
            "date": "12. Okt 2016 14:02",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Beitrag gelöscht</div>",
                    "body_text": "Beitrag gelöscht",
                    "date": "Beitragvon helmi.ben.hmida » 12. Okt 2016 14:02",
                    "user": "helmi.ben.hmida"
                }
            ],
            "title": "Beitrag gelöscht",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34964&sid=761560cc62e3c239d97418da17f17765",
            "views": "152"
        },
        {
            "answers": "0",
            "date": "10. Okt 2016 19:17",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Im Rahmen dieser Abschlussarbeit soll ein Datensatz bestehend aus Video-Metadaten von YouTube gecrawlt werden. Dieser soll anschließend charakterisiert werden, sowie geeignete Modelle, z.B. Verteilungsfunktionen für einzelne Größen gefunden werden. Diese Größen können z.B. Anzahl der Views, Likes oder Comments sein. Diese Charakteristiken und Modelle sollen nun mit der bestehenden Literatur abgeglichen werden, um Änderungen und Trends zu identifizieren. Darüber hinaus soll die Güte von Modellen die aus gecrawlten Daten erzeugt wurden, mit solchen verglichen werden, denen echte Datensätze von Nutzeranfragen an YouTube unterliegen.<br/>Außerdem soll ein Workload Generator programmiert werden, der ein möglichst realistisches Datenset an YouTube-Anfragen generieren kann, wie es z.B. im Netz der Telekom auftreten könnte.<br/><br/>Eine detaillierte Beschreibung findet sich im <strong>PDF</strong>-Dokument. <br/><br/><strong>Kontakt</strong> <br/>Christian Koch, M.Sc.<br/><!-- e --><a href=\"mailto:ckoch@ps.tu-darmstadt.de\">ckoch@ps.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Im Rahmen dieser Abschlussarbeit soll ein Datensatz bestehend aus Video-Metadaten von YouTube gecrawlt werden. Dieser soll anschließend charakterisiert werden, sowie geeignete Modelle, z.B. Verteilungsfunktionen für einzelne Größen gefunden werden. Diese Größen können z.B. Anzahl der Views, Likes oder Comments sein. Diese Charakteristiken und Modelle sollen nun mit der bestehenden Literatur abgeglichen werden, um Änderungen und Trends zu identifizieren. Darüber hinaus soll die Güte von Modellen die aus gecrawlten Daten erzeugt wurden, mit solchen verglichen werden, denen echte Datensätze von Nutzeranfragen an YouTube unterliegen.Außerdem soll ein Workload Generator programmiert werden, der ein möglichst realistisches Datenset an YouTube-Anfragen generieren kann, wie es z.B. im Netz der Telekom auftreten könnte.Eine detaillierte Beschreibung findet sich im PDF-Dokument. Kontakt Christian Koch, M.Sc.ckoch@ps.tu-darmstadt.de",
                    "date": "Beitragvon ckoch » 10. Okt 2016 19:17",
                    "user": "ckoch"
                }
            ],
            "title": "[BA/MA] Charakterisierung und Modellierung  von Lastmodellen für YouTube",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34953&sid=761560cc62e3c239d97418da17f17765",
            "views": "293"
        },
        {
            "answers": "0",
            "date": "10. Okt 2016 19:06",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Im Rahmen dieser Abschlussarbeit soll eine Literaturrecherche durchgeführt werden, welche die aktuellen<br/>Forschungsrichtungen der Cache-Algorithmen beschreibt und entsprechende Arbeiten einordnet. Basierend darauf soll mit Hilfe<br/>eines bereitgestellten Datensatzes bestimmt werden welche Algorithmen für die unterschiedlichen Inhaltsklassen die besten<br/>Ergebnisse erzielen. Diese Ergebnisse sollen in Form einer Evaluation dokumentiert und beschrieben werden.<br/><br/>Eine detaillierte Beschreibung findet sich im <strong>PDF</strong>-Dokument. <br/><br/><strong>Kontakt</strong> <br/>Christian Koch, M.Sc.<br/><!-- e --><a href=\"mailto:ckoch@ps.tu-darmstadt.de\">ckoch@ps.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Im Rahmen dieser Abschlussarbeit soll eine Literaturrecherche durchgeführt werden, welche die aktuellenForschungsrichtungen der Cache-Algorithmen beschreibt und entsprechende Arbeiten einordnet. Basierend darauf soll mit Hilfeeines bereitgestellten Datensatzes bestimmt werden welche Algorithmen für die unterschiedlichen Inhaltsklassen die bestenErgebnisse erzielen. Diese Ergebnisse sollen in Form einer Evaluation dokumentiert und beschrieben werden.Eine detaillierte Beschreibung findet sich im PDF-Dokument. Kontakt Christian Koch, M.Sc.ckoch@ps.tu-darmstadt.de",
                    "date": "Beitragvon ckoch » 10. Okt 2016 19:06",
                    "user": "ckoch"
                }
            ],
            "title": "[BA/MA] Vergleichen von Caching-Strategien in Netzen für unterschiedliche Typen von Inhalten",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34952&sid=761560cc62e3c239d97418da17f17765",
            "views": "245"
        },
        {
            "answers": "0",
            "date": "Neuester Beitrag",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Ich biete eine HiWi Position/Master Thesis an im Bereich Software Defined Networking/Network Function Virtualization an. Konkret geht es um die Erweiterung von Open vSwitch (<!-- m --><a class=\"postlink\" href=\"http://www.openvswitch.org/\">http://www.openvswitch.org/</a><!-- m -->) um selbst zu entwerfende neue OpenFlow Regeltypen (<!-- m --><a class=\"postlink\" href=\"http://archive.openflow.org/wp/learnmore/\">http://archive.openflow.org/wp/learnmore/</a><!-- m -->). Der use case dazu wird von uns vorgegeben.<br/><br/>Vorraussetzungen sind Interesse and Rechnernetzwerken und keine Angst vor low-level Code. Die SDN Vorlesung gehört zu haben ist ein plus, aber nicht zwingend notwendig.<br/><br/>Bewerbungen bitte per E-Mail, weitere Details folgen dann gerne im persönlichen Gespräch: <!-- e --><a href=\"mailto:mwichtlh@ps.tu-darmstadt.de\">mwichtlh@ps.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Ich biete eine HiWi Position/Master Thesis an im Bereich Software Defined Networking/Network Function Virtualization an. Konkret geht es um die Erweiterung von Open vSwitch (http://www.openvswitch.org/) um selbst zu entwerfende neue OpenFlow Regeltypen (http://archive.openflow.org/wp/learnmore/). Der use case dazu wird von uns vorgegeben.Vorraussetzungen sind Interesse and Rechnernetzwerken und keine Angst vor low-level Code. Die SDN Vorlesung gehört zu haben ist ein plus, aber nicht zwingend notwendig.Bewerbungen bitte per E-Mail, weitere Details folgen dann gerne im persönlichen Gespräch: mwichtlh@ps.tu-darmstadt.de",
                    "date": "Beitragvon mwi » 4. Okt 2016 17:40",
                    "user": "mwi"
                }
            ],
            "title": "[MSc Thesis/HiWi] OpenFlow Extension",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34938&sid=761560cc62e3c239d97418da17f17765",
            "views": "202"
        },
        {
            "answers": "0",
            "date": "29. Sep 2016 16:14",
            "thread": [
                {
                    "body_html": "<div class=\"content\">The Smart Living and biometric technology department Fraunhofer IGD is seeking a bachelor candidate to ship the current prototype of eHealth to a more professional version. <br/><br/>The today prototype is composed by the following use cases:<br/>•\tLife chat with formal caregiver<br/>•\tVital sign management<br/>•\tMental training<br/>•\tAgenda<br/> <br/>The expected added value is:<br/>•\tIntegration of HL7 and IHE standard protocol <br/>•\tIntegration of the entire solution within the universAAL Open platform<br/>•\tDevelopment an automatic module for the Vital sign data reception <br/>•\tIncluding the Audio/Video chat <br/>•\tIncrease the system acceptance through the improvement of the interface and the interaction possibility<br/><br/><br/>By interest, please send your CV and motivation to:<br/><br/>Dr. Helmi Ben Hmida<br/><!-- e --><a href=\"mailto:helmi.ben.hmida@igd.fraunhofer.de\">helmi.ben.hmida@igd.fraunhofer.de</a><!-- e --></div>",
                    "body_text": "The Smart Living and biometric technology department Fraunhofer IGD is seeking a bachelor candidate to ship the current prototype of eHealth to a more professional version. The today prototype is composed by the following use cases:•\tLife chat with formal caregiver•\tVital sign management•\tMental training•\tAgenda The expected added value is:•\tIntegration of HL7 and IHE standard protocol •\tIntegration of the entire solution within the universAAL Open platform•\tDevelopment an automatic module for the Vital sign data reception •\tIncluding the Audio/Video chat •\tIncrease the system acceptance through the improvement of the interface and the interaction possibilityBy interest, please send your CV and motivation to:Dr. Helmi Ben Hmidahelmi.ben.hmida@igd.fraunhofer.de",
                    "date": "Beitragvon helmi.ben.hmida » 29. Sep 2016 16:14",
                    "user": "helmi.ben.hmida"
                }
            ],
            "title": "Smart eHealth system",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34929&sid=761560cc62e3c239d97418da17f17765",
            "views": "177"
        },
        {
            "answers": "0",
            "date": "19. Sep 2016 22:16",
            "thread": [
                {
                    "body_html": "<div class=\"content\"><strong>Thema</strong> <br/>Multicast in eine bekannte und vielfach von Internetanbietern eingesetzte Datenübertragungstechnik. Anbieter wie die Deutsche Telekom in Deutschland oder AT&amp;T in den USA nutzen diese Technik längst, um ihre IPTV-Kanäle, z.B. T-Entertain innerhalb ihres Netzes zu verteilen. Für Video-on-Demand-Dienste, wie YouTube oder die ZDF-Mediathek konnte Multicast bisher nicht eingesetzt werden, da hier die Wiedergabeposition des Videos für jeden Nutzer individuell ist. Zudem ist die große Anzahl an verfügbaren Videos um ein Vielfaches größer als die Anzahl an IPTV-Kanälen.  <br/><br/><strong>Aufgabe</strong><br/>Es wurde bereits gezeigt, dass auch in VoD(Video on Demand)-Szenarien-Szenarien, Multicast dazu beitragen kann den Datenverkehr in Providernetzen erheblich zu reduzieren. In dieser Abschlussarbeit sollen das Potential von Multicast für VoD untersucht und durch vorgeschlagene Methoden optimiert werden. Eine Möglichkeit dies zu erreichen ist es die Videos, für die Multicast genutzt werden soll so auszuwählen, dass die eingesparte Netzlast maximiert wird. <br/>Es existiert bereits eine Vorarbeit die für die Abschlussarbeit genutzt werden kann. Weitere Fragen zu Code, Daten und ersten Ideen würde ich sehr gern im persönlichen Gespräch austauschen. Je nachdem, ob eine Bachelor- oder Masterarbeit angestrebt ist, kann der Umfang der Arbeit angepasst werden.<br/><br/><strong>Kenntnisse</strong><br/>- Grundlegende Kenntnisse über Netzwerke<br/>- Erstellung einer prototypischen Simulation (C++)<br/>- Eigenständiges Arbeiten<br/><br/><strong>Was wir bieten</strong><br/>- Regelmäßige Treffen und Betreuung<br/>- Auf Wunsch einen Arbeitsplatz vor Ort<br/>- Server zum Ausführen von Code<br/><br/><strong>Kontakt</strong> <br/>Christian Koch, M.Sc.<br/><!-- e --><a href=\"mailto:ckoch@ps.tu-darmstadt.de\">ckoch@ps.tu-darmstadt.de</a><!-- e --></div>",
                    "body_text": "Thema Multicast in eine bekannte und vielfach von Internetanbietern eingesetzte Datenübertragungstechnik. Anbieter wie die Deutsche Telekom in Deutschland oder AT&T in den USA nutzen diese Technik längst, um ihre IPTV-Kanäle, z.B. T-Entertain innerhalb ihres Netzes zu verteilen. Für Video-on-Demand-Dienste, wie YouTube oder die ZDF-Mediathek konnte Multicast bisher nicht eingesetzt werden, da hier die Wiedergabeposition des Videos für jeden Nutzer individuell ist. Zudem ist die große Anzahl an verfügbaren Videos um ein Vielfaches größer als die Anzahl an IPTV-Kanälen.  AufgabeEs wurde bereits gezeigt, dass auch in VoD(Video on Demand)-Szenarien-Szenarien, Multicast dazu beitragen kann den Datenverkehr in Providernetzen erheblich zu reduzieren. In dieser Abschlussarbeit sollen das Potential von Multicast für VoD untersucht und durch vorgeschlagene Methoden optimiert werden. Eine Möglichkeit dies zu erreichen ist es die Videos, für die Multicast genutzt werden soll so auszuwählen, dass die eingesparte Netzlast maximiert wird. Es existiert bereits eine Vorarbeit die für die Abschlussarbeit genutzt werden kann. Weitere Fragen zu Code, Daten und ersten Ideen würde ich sehr gern im persönlichen Gespräch austauschen. Je nachdem, ob eine Bachelor- oder Masterarbeit angestrebt ist, kann der Umfang der Arbeit angepasst werden.Kenntnisse- Grundlegende Kenntnisse über Netzwerke- Erstellung einer prototypischen Simulation (C++)- Eigenständiges ArbeitenWas wir bieten- Regelmäßige Treffen und Betreuung- Auf Wunsch einen Arbeitsplatz vor Ort- Server zum Ausführen von CodeKontakt Christian Koch, M.Sc.ckoch@ps.tu-darmstadt.de",
                    "date": "Beitragvon ckoch » 19. Sep 2016 22:16",
                    "user": "ckoch"
                }
            ],
            "title": "Bachelor-/Masterarbeit: Das Potential von Multicast im zukünftigen Internet am Beispiel von YouTube",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34908&sid=761560cc62e3c239d97418da17f17765",
            "views": "199"
        },
        {
            "answers": "1",
            "date": "Neuester Beitrag",
            "thread": [
                {
                    "body_html": "<div class=\"content\">M.Sc./ B.Sc.: Gamifying the Production of Live Video<br/>Mobile video is a tremendous trend which allows watching video content anywhere and anytime. To an increasing extent the video is recorded by users on their own using their mobile devices. Interesting events such as concerts or festivals already attract dozens of users recording the event simultaneously. Only people visiting the events are able to record video and share it with their friends all around the world. But how can users be motivated in order to record video and transmit data over the network? <br/><br/>Gamification of the collaborative video generation may give answers to that questions. In this thesis gamification of crowdsourcing live video generation shall be evaluated. <br/><br/>During this work an existing gamification approach shall be improved.<br/>In a first step the student shall evaluate an existing, deployed approach and use the gathered findings to improve our gamification framework.<br/><br/>More information on:<br/><!-- m --><a class=\"postlink\" href=\"http://www.dms.informatik.tu-darmstadt.de/teaching/bachelor-master-theses/\">http://www.dms.informatik.tu-darmstadt. ... er-theses/</a><!-- m --><br/><br/>Contact<br/>Stefan Wilk<br/><!-- e --><a href=\"mailto:stefan.wilk@cs.tu-darmstadt.de\">stefan.wilk@cs.tu-darmstadt.de</a><!-- e --><br/><a class=\"postlink\" href=\"http://www.dms.informatik.tu-darmstadt.de\">http://www.dms.informatik.tu-darmstadt.de</a><br/>S3|20 221</div>",
                    "body_text": "M.Sc./ B.Sc.: Gamifying the Production of Live VideoMobile video is a tremendous trend which allows watching video content anywhere and anytime. To an increasing extent the video is recorded by users on their own using their mobile devices. Interesting events such as concerts or festivals already attract dozens of users recording the event simultaneously. Only people visiting the events are able to record video and share it with their friends all around the world. But how can users be motivated in order to record video and transmit data over the network? Gamification of the collaborative video generation may give answers to that questions. In this thesis gamification of crowdsourcing live video generation shall be evaluated. During this work an existing gamification approach shall be improved.In a first step the student shall evaluate an existing, deployed approach and use the gathered findings to improve our gamification framework.More information on:http://www.dms.informatik.tu-darmstadt. ... er-theses/ContactStefan Wilkstefan.wilk@cs.tu-darmstadt.dehttp://www.dms.informatik.tu-darmstadt.deS3|20 221",
                    "date": "Beitragvon sw_tuda » 15. Feb 2015 23:17",
                    "user": "sw_tuda"
                },
                {
                    "body_html": "<div class=\"content\">Got some very important knowledge to share with you today: <br/>Tons of good education videos and e books for free, <br/>to spread and to promote all over the web. <br/><br/>Since we are Tecademics- founders <br/>you can now also profit out of it <br/>simply by sharing and promoting the following link to your audience <br/>(and also ask them to pay it forward and keep spreading it ahead...). <br/><br/>You get great commissions for no investment at all <br/>and have nothing to put in, but your time...<br/>Oh, and they also have great prizes and bonuses to give away,<br/>but you better check it for yourself. <br/>This one for example is about gamify life, <br/>and it's just simply unbelievable funny...:<br/><br/><!-- m --><a class=\"postlink\" href=\"http://2bsur.tcdmcs.com/gamifylife\">http://2bsur.tcdmcs.com/gamifylife</a><!-- m --><br/><br/>Wishing you a great weekend, full of joy, and keep in touch please...!</div>",
                    "body_text": "Got some very important knowledge to share with you today: Tons of good education videos and e books for free, to spread and to promote all over the web. Since we are Tecademics- founders you can now also profit out of it simply by sharing and promoting the following link to your audience (and also ask them to pay it forward and keep spreading it ahead...). You get great commissions for no investment at all and have nothing to put in, but your time...Oh, and they also have great prizes and bonuses to give away,but you better check it for yourself. This one for example is about gamify life, and it's just simply unbelievable funny...:http://2bsur.tcdmcs.com/gamifylifeWishing you a great weekend, full of joy, and keep in touch please...!",
                    "date": "Beitragvon Lixie » 2. Sep 2016 12:14",
                    "user": "Lixie"
                }
            ],
            "title": "Gamifying the Production of Live Video",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=31592&sid=761560cc62e3c239d97418da17f17765",
            "views": "335"
        },
        {
            "answers": "0",
            "date": "29. Aug 2016 14:08",
            "thread": [
                {
                    "body_html": "<div class=\"content\"><strong>CRISP</strong> <br/>Die bisher vom Bund (EC SPRIDE) und dem Land Hessen (CASED) finanzierten IT-Sicherheits-Forschungszentren bündeln ihre Kräfte im „Center for Research in Security and Privacy\"  kurz CRISP. <br/>Mit dem Kernthema \"Security At Large\" steht die Erforschung von Sicherheit für große Systeme – von den Komponenten bis zu ihrem Zusammenspiel in umfassenden Sicherheitslösungen - im Fokus der Forschungsaktivitäten. <br/><br/><br/><strong>Hintergrund</strong> <br/>Die Wertschöpfungskette der Industrie 4.0 besteht aus einer Vielzahl verschiedener Teilnehmer deren Vernetzung immer weiter vorangetrieben wird. Da es sich dabei um eine massiv Geräte-zentrische Domäne handelt, müssen Geräte mit einer einzigartigen Identität versehen werden, um eine sichere Kommunikation durch Authentifikations- und Verschlüsselungsverfahren zu ermöglichen. Um hierbei Abhängigkeiten zu anderen Infrastrukturen zu minimieren, erhalten Geräte dabei die Möglichkeit eine eigene geräteinterne PKI mittels Trusted Platform Modulen (TPM) aufzubauen und mit deren Hilfe eigene Identitäten für die Kommunikation zu erzeugen. Basis dafür bildet eine Erweiterung des Secure Initial Device Identifier Standards IEEE 802.1AR. Basierend auf diesen Geräteidentitäten können dabei verschiedenste Use Cases implementiert werden. Im Rahmen dieser Arbeit soll dabei ein sicheres Updateverfahren entwickelt werden, dass es einem Gerätehersteller ermöglicht Softwareupdates über eine Netzwerkverbindung einzuspielen und den Zustand der Geräte vor und nach einem Update zu überprüfen. <br/><br/><strong>Aufgaben</strong> <br/>•\tErmitteln von Anforderungen <br/>•\tKonzeption und Implementierung eines sicheren Updateverfahrens basierend auf Geräteidentitäten <br/>•\tEvaluierung der Lösung <br/><br/><strong>Voraussetzungen</strong> <br/>•\tGute Grundlagenkenntnisse im Bereich IT-Sicherheit<br/>•\tGute Programmierkenntnisse in C, weitere Kenntnisse von Vorteil<br/>•\tErfahrungen mit Linux und TPMs von Vorteil<br/>•\tGute Sprachkenntnisse in Deutsch und Englisch<br/> <br/><strong>Kontakt</strong> <br/>Markus Springer<br/><!-- e --><a href=\"mailto:markus.springer@sit.fraunhofer.de\">markus.springer@sit.fraunhofer.de</a><!-- e --><br/>Fraunhofer-Institut für Sichere Informationstechnologie<br/>Rheinstr. 75<br/>64295 Darmstadt<br/>Tel. 06151 869 179</div>",
                    "body_text": "CRISP Die bisher vom Bund (EC SPRIDE) und dem Land Hessen (CASED) finanzierten IT-Sicherheits-Forschungszentren bündeln ihre Kräfte im „Center for Research in Security and Privacy\"  kurz CRISP. Mit dem Kernthema \"Security At Large\" steht die Erforschung von Sicherheit für große Systeme – von den Komponenten bis zu ihrem Zusammenspiel in umfassenden Sicherheitslösungen - im Fokus der Forschungsaktivitäten. Hintergrund Die Wertschöpfungskette der Industrie 4.0 besteht aus einer Vielzahl verschiedener Teilnehmer deren Vernetzung immer weiter vorangetrieben wird. Da es sich dabei um eine massiv Geräte-zentrische Domäne handelt, müssen Geräte mit einer einzigartigen Identität versehen werden, um eine sichere Kommunikation durch Authentifikations- und Verschlüsselungsverfahren zu ermöglichen. Um hierbei Abhängigkeiten zu anderen Infrastrukturen zu minimieren, erhalten Geräte dabei die Möglichkeit eine eigene geräteinterne PKI mittels Trusted Platform Modulen (TPM) aufzubauen und mit deren Hilfe eigene Identitäten für die Kommunikation zu erzeugen. Basis dafür bildet eine Erweiterung des Secure Initial Device Identifier Standards IEEE 802.1AR. Basierend auf diesen Geräteidentitäten können dabei verschiedenste Use Cases implementiert werden. Im Rahmen dieser Arbeit soll dabei ein sicheres Updateverfahren entwickelt werden, dass es einem Gerätehersteller ermöglicht Softwareupdates über eine Netzwerkverbindung einzuspielen und den Zustand der Geräte vor und nach einem Update zu überprüfen. Aufgaben •\tErmitteln von Anforderungen •\tKonzeption und Implementierung eines sicheren Updateverfahrens basierend auf Geräteidentitäten •\tEvaluierung der Lösung Voraussetzungen •\tGute Grundlagenkenntnisse im Bereich IT-Sicherheit•\tGute Programmierkenntnisse in C, weitere Kenntnisse von Vorteil•\tErfahrungen mit Linux und TPMs von Vorteil•\tGute Sprachkenntnisse in Deutsch und Englisch Kontakt Markus Springermarkus.springer@sit.fraunhofer.deFraunhofer-Institut für Sichere InformationstechnologieRheinstr. 7564295 DarmstadtTel. 06151 869 179",
                    "date": "Beitragvon Fraunhofer SIT BB » 29. Aug 2016 14:08",
                    "user": "Fraunhofer SIT BB"
                }
            ],
            "title": "Masterarbeit: Entwicklung eines identitätsbasierten sicheren Updateverfahrens",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34770&sid=761560cc62e3c239d97418da17f17765",
            "views": "231"
        },
        {
            "answers": "1",
            "date": "Neuester Beitrag",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Die Abteilung Medizinische und Biologische Informatik (MBI) des Deutschen Krebsforschungszentrums (DKFZ) vergibt eine<br/><br/>Bachelorarbeit zum Thema GPU-Programmierung<br/><br/>im Bereich der Informatik, Natur- u. Ingenieurwissenschaften<br/><br/>In der multispektralen Bildanalyse ist größte Herausforderung die Detektion von bösartigem Gewebe. Dabei ist die Simulation der Interaktion von Licht mit Gewebe mittels <br/><br/>Monte Carlo Methoden ein Grundstein, auf dem spätere Algorithmen aufbauen.<br/><br/>In dieser Bachelorarbeit soll ein bestehendes, GPU beschleunigtes Monte Carlo Simulationsprogramm auf neue GPU Architekturen (Maxwell) portiert werden. Durch den erwarteten Geschwindigkeitsanstieg werden neuartige, zuvor nicht praktisch durchführbare multispektrale Analysemethoden ermöglicht. Die Bachelorarbeit kann optional um die Simulation von inhomogenen Gewebe erweitert werden.<br/> <br/>Die derzeitige Version der Simulation ist verfügbar unter <!-- m --><a class=\"postlink\" href=\"https://github.com/ominux/gpumcml\">https://github.com/ominux/gpumcml</a><!-- m --> und wurde im Journal Biomed. Optics (Alerstam et al., Next-generation acceleration and code optimization for light transport in turbid media using GPUs, 2010) veröffentlicht.<br/><br/>Wir bieten:<br/> * Spannende aktuelle Forschungsprojekte mit hoher Relevanz<br/> * Direkte Betreuung und Mitarbeit in einem interdisziplinären Team<br/> * Moderne und nachhaltige Methoden in der Softwareentwicklung<br/> * Zusammenarbeit mit Partnern aus Industrie und Klinik<br/> * Begleitendes Seminarprogramm zu Forschung und Softwareentwicklung<br/><br/>Wir erwarten:<br/> * Kenntnisse im Bereich GPU Programmierung sind von Vorteil<br/> * Leistungsbereitschaft und Kreativität<br/> * Programmierkenntnisse (C++)<br/> * Sehr gute Leistungen im Studium (Informatik, Physik, Mathematik, …)<br/><br/>Bitte richten Sie Ihre aussagekräftige Bewerbung (am besten per E-Mail) an:<br/><br/>Keno März<br/>+49 6221 42 35 58<br/> <!-- e --><a href=\"mailto:mbi-bewerbungen@dkfz.de\">mbi-bewerbungen@dkfz.de</a><!-- e --><br/><br/>Weitere Infos unter<br/><!-- m --><a class=\"postlink\" href=\"http://www.dkfz.de/de/mbi/\">http://www.dkfz.de/de/mbi/</a><!-- m --></div>",
                    "body_text": "Die Abteilung Medizinische und Biologische Informatik (MBI) des Deutschen Krebsforschungszentrums (DKFZ) vergibt eineBachelorarbeit zum Thema GPU-Programmierungim Bereich der Informatik, Natur- u. IngenieurwissenschaftenIn der multispektralen Bildanalyse ist größte Herausforderung die Detektion von bösartigem Gewebe. Dabei ist die Simulation der Interaktion von Licht mit Gewebe mittels Monte Carlo Methoden ein Grundstein, auf dem spätere Algorithmen aufbauen.In dieser Bachelorarbeit soll ein bestehendes, GPU beschleunigtes Monte Carlo Simulationsprogramm auf neue GPU Architekturen (Maxwell) portiert werden. Durch den erwarteten Geschwindigkeitsanstieg werden neuartige, zuvor nicht praktisch durchführbare multispektrale Analysemethoden ermöglicht. Die Bachelorarbeit kann optional um die Simulation von inhomogenen Gewebe erweitert werden. Die derzeitige Version der Simulation ist verfügbar unter https://github.com/ominux/gpumcml und wurde im Journal Biomed. Optics (Alerstam et al., Next-generation acceleration and code optimization for light transport in turbid media using GPUs, 2010) veröffentlicht.Wir bieten: * Spannende aktuelle Forschungsprojekte mit hoher Relevanz * Direkte Betreuung und Mitarbeit in einem interdisziplinären Team * Moderne und nachhaltige Methoden in der Softwareentwicklung * Zusammenarbeit mit Partnern aus Industrie und Klinik * Begleitendes Seminarprogramm zu Forschung und SoftwareentwicklungWir erwarten: * Kenntnisse im Bereich GPU Programmierung sind von Vorteil * Leistungsbereitschaft und Kreativität * Programmierkenntnisse (C++) * Sehr gute Leistungen im Studium (Informatik, Physik, Mathematik, …)Bitte richten Sie Ihre aussagekräftige Bewerbung (am besten per E-Mail) an:Keno März+49 6221 42 35 58 mbi-bewerbungen@dkfz.deWeitere Infos unterhttp://www.dkfz.de/de/mbi/",
                    "date": "Beitragvon dkfz » 10. Aug 2016 10:27",
                    "user": "dkfz"
                },
                {
                    "body_html": "<div class=\"content\">Das Deutsche Krebsforschungszentrum (DKFZ) befindet sich im Neuenheimer Feld in Heidelberg</div>",
                    "body_text": "Das Deutsche Krebsforschungszentrum (DKFZ) befindet sich im Neuenheimer Feld in Heidelberg",
                    "date": "Beitragvon dkfz » 10. Aug 2016 10:35",
                    "user": "dkfz"
                }
            ],
            "title": "Bachelorarbeit zum Thema GPU-Programmierung",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34698&sid=761560cc62e3c239d97418da17f17765",
            "views": "291"
        },
        {
            "answers": "0",
            "date": "3. Aug 2016 16:51",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Die neue Fachgruppe Programmierung von verteilten Systemen unter der Leitung von Prof. Patrick Eugster, bietet ab sofort mehrere Themen für eine Masterthesis an.<br/><br/><strong><span style=\"font-size: 150%; line-height: normal\">Masterthesis zum Thema Latenzoptimierung für Transaktionen verteilter Datenbanken</span></strong><br/><br/>In dieser Arbeit sollen Möglichkeiten erforscht werden, wie Datenbanktransaktionen Nachrichten, auf einem Linux-basiertem System, mit möglichst geringer Varianz und berechenbarer Latenz beantwortet werden können. Dadurch werden genaue Latenzabschätzungen möglich die für verteilte Datenbanken extrem wichtig ist, um nicht länger pessimistische Annahmen treffen zu müssen.<br/><br/><strong>Aufgaben</strong><br/>- Erstellen einer Simulation zur Problemevaluation<br/>- Anpassung bzw. Implementierung des Linuxkernels / DPDK Frameworks<br/>- Anpassung bzw. Erweiterung des Transaktionsmanagers einer OpenSource Datenbank z.B. Silo<br/>- Evaluation des Systems<br/><br/><strong>Kenntnisse</strong><br/>- Programmiererfahrung in C, C++ und Java wünschenswert<br/>- Allgemeine Kenntnisse Transaktionsmanagement von Datenbanken<br/>- Linuxkenntnisse insbesondere Kernel und Treiberprogrammierung wünschenswert<br/>- Kenntnisse über DPDK wünschenswert<br/><br/>Alle in der Fachgruppe angebotenen Arbeiten haben einen aktuellen Forschungsbezug in Kombination mit Problemstellungen, wie sie in großen verteilten Systeme in der Wirtschaft zu finden sind. Ein forschungsrelevantes Ergebnis auf internationaler Ebene ist wünschenswert und wird daher auch mit der entsprechenden Sorgfalt betreut. Ein hohes Maß an Motivation für verteilte Systeme und Eigenverantwortung ist sehr wichtig. Alle Arbeiten bieten auch Freiräume, um auf individuelle Forschungsinteresse eingehen zu können.<br/><br/><br/><strong><span style=\"font-size: 150%; line-height: normal\">Mobile Monitoring Agenten von Software definierten Netzwerken (SDN)</span></strong><br/><br/>In dieser Arbeit sollen Möglichkeiten erforscht werden, wie ein Echzeitmonitoringsystem in einem Software definierten Netzwerk (SDN) umgesetzt werden kann. Hierbei ist es wichtig, denn aktuellen Zustand eines Netzwerkes und dessen Teilnehmer (verteilte Systeme) in Echtzeit zu erfassen, die gewonnen Daten aufzubereiten und zu verteilen, um eine gute Skalierbarkeit zu erreichen. Weiter soll ein bestehender Prototyp welcher auf OpenVSwitches implementiert worden ist, auf Linux-basierten Bare Metal Switches implementiert werden.<br/> <br/>Aufgaben<br/>- Erstellen einer Simulation um das Problem zu evaluieren<br/>- Entwicklung einer Infrastruktur bzw. Anpassung eines SDN Controllers<br/>- Simulationslösung auf Hardwareswitches übertragen<br/> <br/>Alle in der Fachgruppe angebotenen Arbeiten haben einen aktuellen Forschungsbezug in Kombination mit Problemstellungen, wie sie in großen verteilten Systeme in der Wirtschaft zu finden sind. Ein forschungsrelevantes Ergebnis auf internationaler Ebene ist wünschenswert und wird daher auch mit der entsprechenden Sorgfalt betreut. Ein hohes Maß an Motivation für verteilte Systeme und Eigenverantwortung ist sehr wichtig. Alle Arbeiten bieten auch Freiräume, um auf individuelle Forschungsinteresse eingehen zu können.<br/><br/>Dauer<br/>6 Monate<br/><br/>Start<br/>ab sofort<br/><br/>Kontakt<br/>Patrick Jahnke<br/>jahnke(at)dsp.tu-darmstadt.de<br/>Distributed System Programming<br/>Hochschulstraße 10, S2|20, Raum A307</div>",
                    "body_text": "Die neue Fachgruppe Programmierung von verteilten Systemen unter der Leitung von Prof. Patrick Eugster, bietet ab sofort mehrere Themen für eine Masterthesis an.Masterthesis zum Thema Latenzoptimierung für Transaktionen verteilter DatenbankenIn dieser Arbeit sollen Möglichkeiten erforscht werden, wie Datenbanktransaktionen Nachrichten, auf einem Linux-basiertem System, mit möglichst geringer Varianz und berechenbarer Latenz beantwortet werden können. Dadurch werden genaue Latenzabschätzungen möglich die für verteilte Datenbanken extrem wichtig ist, um nicht länger pessimistische Annahmen treffen zu müssen.Aufgaben- Erstellen einer Simulation zur Problemevaluation- Anpassung bzw. Implementierung des Linuxkernels / DPDK Frameworks- Anpassung bzw. Erweiterung des Transaktionsmanagers einer OpenSource Datenbank z.B. Silo- Evaluation des SystemsKenntnisse- Programmiererfahrung in C, C++ und Java wünschenswert- Allgemeine Kenntnisse Transaktionsmanagement von Datenbanken- Linuxkenntnisse insbesondere Kernel und Treiberprogrammierung wünschenswert- Kenntnisse über DPDK wünschenswertAlle in der Fachgruppe angebotenen Arbeiten haben einen aktuellen Forschungsbezug in Kombination mit Problemstellungen, wie sie in großen verteilten Systeme in der Wirtschaft zu finden sind. Ein forschungsrelevantes Ergebnis auf internationaler Ebene ist wünschenswert und wird daher auch mit der entsprechenden Sorgfalt betreut. Ein hohes Maß an Motivation für verteilte Systeme und Eigenverantwortung ist sehr wichtig. Alle Arbeiten bieten auch Freiräume, um auf individuelle Forschungsinteresse eingehen zu können.Mobile Monitoring Agenten von Software definierten Netzwerken (SDN)In dieser Arbeit sollen Möglichkeiten erforscht werden, wie ein Echzeitmonitoringsystem in einem Software definierten Netzwerk (SDN) umgesetzt werden kann. Hierbei ist es wichtig, denn aktuellen Zustand eines Netzwerkes und dessen Teilnehmer (verteilte Systeme) in Echtzeit zu erfassen, die gewonnen Daten aufzubereiten und zu verteilen, um eine gute Skalierbarkeit zu erreichen. Weiter soll ein bestehender Prototyp welcher auf OpenVSwitches implementiert worden ist, auf Linux-basierten Bare Metal Switches implementiert werden. Aufgaben- Erstellen einer Simulation um das Problem zu evaluieren- Entwicklung einer Infrastruktur bzw. Anpassung eines SDN Controllers- Simulationslösung auf Hardwareswitches übertragen Alle in der Fachgruppe angebotenen Arbeiten haben einen aktuellen Forschungsbezug in Kombination mit Problemstellungen, wie sie in großen verteilten Systeme in der Wirtschaft zu finden sind. Ein forschungsrelevantes Ergebnis auf internationaler Ebene ist wünschenswert und wird daher auch mit der entsprechenden Sorgfalt betreut. Ein hohes Maß an Motivation für verteilte Systeme und Eigenverantwortung ist sehr wichtig. Alle Arbeiten bieten auch Freiräume, um auf individuelle Forschungsinteresse eingehen zu können.Dauer6 MonateStartab sofortKontaktPatrick Jahnkejahnke(at)dsp.tu-darmstadt.deDistributed System ProgrammingHochschulstraße 10, S2|20, Raum A307",
                    "date": "Beitragvon patrix » 3. Aug 2016 16:51",
                    "user": "patrix"
                }
            ],
            "title": "Masterarbeiten im Bereich Verteilte System Programmierung / Software-definierte Netze (SDN)",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34675&sid=761560cc62e3c239d97418da17f17765",
            "views": "234"
        },
        {
            "answers": "4",
            "date": "23. Jul 2016 02:51",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Jul 19, 2016 – Master thesis, internal<br/><br/>Multi-label classification is the task of assigning a set of labels from a fixed vocabulary to a sample of data i.e. image, audio, text, etc. Multi-label text classification has been applied to a multitude of tasks, including document indexing, tag suggestion, and sentiment classification. However, many of the applied methods disregard word order, opting to use bag-of-words models or TFIDF weighting to create document vectors. With the advent of powerful semantic embeddings, such as word2vec and GloVe, we want to investigate how word embeddings and word order can be used to improve multi-label classification. Word embeddings is one of the strongest trends in Natural Language Processing (NLP). It is a technique to learn semantically meaningful representations for words from local co-occurrences in sentences. The relative similarity between two words vector representations as well as words order can capture meaningful syntactic and semantic regularities. <br/><br/><strong>Task description</strong><br/>In this work, we will start with performing a comparative analysis of the existing methods for multi-label text classification. Later on we aim to develop/adapt machine learning methods (mainly Deep Learning) to improve the multi-label text classification. By considering word order and their vector representation, new features space will be created which can be leveraged by traditional machine learning or deep learning models to introduce new efficient approaches for multi-label learning.<br/><br/>The written report must contain an introduction to the topic and provide an overview of related work. Furthermore, the designed and implemented methods must be described and discussed. <br/><br/><strong>Requirements</strong><br/>•\tGood programming skills in mind. A high level language like Java or functional language like R<br/>•\tHelpful: Previous experience in Natural Language Processing and Machine Learning<br/><br/><strong>Beginning and duration</strong><br/>Immediately, duration 3-6 months (depending on the course)<br/><br/><br/><strong>Keywords</strong>: NLP, Semantic Web, Machine Learning, Clustering, Deep Learning, Word Embeddings<br/><br/><strong>Research Area(s)</strong>: Knowledge &amp; Educational Technologies<br/><br/><strong>Contact</strong><br/>Wael Alkhatib , M.Sc. &lt;Wael.Alkhatib@kom.tu-darmstadt.de &gt;<br/>Fachgebiet Multimedia Kommunikation<br/>Building S3|20 127</div>",
                    "body_text": "Jul 19, 2016 – Master thesis, internalMulti-label classification is the task of assigning a set of labels from a fixed vocabulary to a sample of data i.e. image, audio, text, etc. Multi-label text classification has been applied to a multitude of tasks, including document indexing, tag suggestion, and sentiment classification. However, many of the applied methods disregard word order, opting to use bag-of-words models or TFIDF weighting to create document vectors. With the advent of powerful semantic embeddings, such as word2vec and GloVe, we want to investigate how word embeddings and word order can be used to improve multi-label classification. Word embeddings is one of the strongest trends in Natural Language Processing (NLP). It is a technique to learn semantically meaningful representations for words from local co-occurrences in sentences. The relative similarity between two words vector representations as well as words order can capture meaningful syntactic and semantic regularities. Task descriptionIn this work, we will start with performing a comparative analysis of the existing methods for multi-label text classification. Later on we aim to develop/adapt machine learning methods (mainly Deep Learning) to improve the multi-label text classification. By considering word order and their vector representation, new features space will be created which can be leveraged by traditional machine learning or deep learning models to introduce new efficient approaches for multi-label learning.The written report must contain an introduction to the topic and provide an overview of related work. Furthermore, the designed and implemented methods must be described and discussed. Requirements•\tGood programming skills in mind. A high level language like Java or functional language like R•\tHelpful: Previous experience in Natural Language Processing and Machine LearningBeginning and durationImmediately, duration 3-6 months (depending on the course)Keywords: NLP, Semantic Web, Machine Learning, Clustering, Deep Learning, Word EmbeddingsResearch Area(s): Knowledge & Educational TechnologiesContactWael Alkhatib , M.Sc. <Wael.Alkhatib@kom.tu-darmstadt.de >Fachgebiet Multimedia KommunikationBuilding S3|20 127",
                    "date": "Beitragvon wkht » 22. Jul 2016 16:49",
                    "user": "wkht"
                },
                {
                    "body_html": "<div class=\"content\">Hallo Herr Wael Alkhatib,<br/><br/>ich bin auf der Suche nach einem Masterthema und dieses Thema interessiert mich sehr. Über gute Kenntnisse in Java verfüge ich und ich habe auch die Vorlesung Machinelles Lerner gehört. An der Uni bin ich schon klausurfrei und kann jede Zeit mit meinem Abschluss anfangen.<br/>Ich würde mich sehr freuen, wenn wir einen Termin am kommenden Woche festmachen könnten.<br/>Auf Ihre Antwort freue ich mich sehr.<br/><br/>Viele Grüße<br/>Ferdinand Kameni</div>",
                    "body_text": "Hallo Herr Wael Alkhatib,ich bin auf der Suche nach einem Masterthema und dieses Thema interessiert mich sehr. Über gute Kenntnisse in Java verfüge ich und ich habe auch die Vorlesung Machinelles Lerner gehört. An der Uni bin ich schon klausurfrei und kann jede Zeit mit meinem Abschluss anfangen.Ich würde mich sehr freuen, wenn wir einen Termin am kommenden Woche festmachen könnten.Auf Ihre Antwort freue ich mich sehr.Viele GrüßeFerdinand Kameni",
                    "date": "Beitragvon fleukam » 22. Jul 2016 19:00",
                    "user": "fleukam"
                },
                {
                    "body_html": "<div class=\"content\">Hallo Herr Ferdinand Kameni,<br/><br/>wir können uns am nächsten Mittwoch 27.07 um 14:00 Uhr in unserer Abteilung treffen. Schreib mir eine E-Mail, den Termin zu bestätigen.<br/><br/>Viele Grüße,<br/>Wael Alkhatib</div>",
                    "body_text": "Hallo Herr Ferdinand Kameni,wir können uns am nächsten Mittwoch 27.07 um 14:00 Uhr in unserer Abteilung treffen. Schreib mir eine E-Mail, den Termin zu bestätigen.Viele Grüße,Wael Alkhatib",
                    "date": "Beitragvon Gast » 22. Jul 2016 22:49",
                    "user": "Gast"
                },
                {
                    "body_html": "<div class=\"content\">Hallo Herr Ferdinand Kameni,<br/><br/>wir können uns am nächsten Mittwoch 27.07 um 14:00 Uhr in unserer Abteilung treffen. Schreib mir eine E-Mail, den Termin zu bestätigen.<br/><br/>Viele Grüße,<br/>Wael Alkhatib</div>",
                    "body_text": "Hallo Herr Ferdinand Kameni,wir können uns am nächsten Mittwoch 27.07 um 14:00 Uhr in unserer Abteilung treffen. Schreib mir eine E-Mail, den Termin zu bestätigen.Viele Grüße,Wael Alkhatib",
                    "date": "Beitragvon wkht » 22. Jul 2016 23:01",
                    "user": "wkht"
                },
                {
                    "body_html": "<div class=\"content\">Hallo Herr Wael Alkhatib,<br/><br/>Der Termin passt mir sehr gut. ich werde um 14 Uhr am Mittwoch da sein. Vielen Dank für diesen Termin.<br/><br/>Viele Grüße<br/>Ferdinand Kameni</div>",
                    "body_text": "Hallo Herr Wael Alkhatib,Der Termin passt mir sehr gut. ich werde um 14 Uhr am Mittwoch da sein. Vielen Dank für diesen Termin.Viele GrüßeFerdinand Kameni",
                    "date": "Beitragvon fleukam » 23. Jul 2016 02:51",
                    "user": "fleukam"
                }
            ],
            "title": "Master thesis: Efficient Multi-label Text Classification using Semantic Word Vectors",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34640&sid=761560cc62e3c239d97418da17f17765",
            "views": "330"
        },
        {
            "answers": "0",
            "date": "22. Jul 2016 16:46",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Jul 19, 2016 – Bachelor thesis/Master thesis, internal<br/><br/>Word embeddings is one of the strongest trends in Natural Language Processing (NLP). It is a technique to learn semantically meaningful representations for words from local co-occurrences in sentences. Based on Distributional Hypothesis, which states that words that appear in the same contexts share semantic meaning. The different approaches that leverage this principle can be divided into two categories: count-based methods (e.g. Latent Semantic Analysis), and predictive methods (e.g. neural probabilistic language models). In word2vec, which is predictive model for learning word embeddings, a distributed representation of a word is used. Take a vector with several hundred dimensions, each word is represented by a distribution of weights across those elements instead of a one-to-one mapping. In this context, each element in the vector contributes to the definition of many words. The relative similarity between two words vector representations can capture meaningful syntactic and semantic regularities. This can significantly contribute to the different NLP tasks like semantic analysis, (Synonym, Meronym, Hyponym) extraction, sentence tagging, question answering systems, documents classification, and so on tasks.<br/><br/><strong>Task description</strong><br/><br/>The aim of this work is to develop/adapt machine learning methods for identifying syntactic and semantic relations between words based on their vector representations. Basically, the evaluation of word embeddings performance for extracting (Synonym, Meronym, Hyponym, etc.) relations between words from large text corpus like Wikipedia. <br/><br/>The written report must contain an introduction to the topic and provide an overview of related work. Furthermore, the designed and implemented methods must be described and discussed. The report can be written in either German or English.<br/><br/><strong>Requirements</strong><br/>•\tGood programming skills in mind. A high level language like Java or functional language like R<br/>•\tHelpful: Previous experience in Natural Language Processing and Machine Learning<br/><br/><strong>Beginning and duration</strong><br/><br/>Immediately, duration 3-6 months (depending on the course)<br/><br/><strong>Keywords</strong>: NLP, Word Embeddings, Machine Learning, Deep Learning<br/><br/><strong>Research Area(s)</strong>: Knowledge &amp; Educational Technologies<br/><br/><strong>Contact</strong><br/>Wael Alkhatib , M.Sc. &lt;Wael.Alkhatib@kom.tu-darmstadt.de &gt;<br/>Fachgebiet Multimedia Kommunikation<br/>Building S3|20 127</div>",
                    "body_text": "Jul 19, 2016 – Bachelor thesis/Master thesis, internalWord embeddings is one of the strongest trends in Natural Language Processing (NLP). It is a technique to learn semantically meaningful representations for words from local co-occurrences in sentences. Based on Distributional Hypothesis, which states that words that appear in the same contexts share semantic meaning. The different approaches that leverage this principle can be divided into two categories: count-based methods (e.g. Latent Semantic Analysis), and predictive methods (e.g. neural probabilistic language models). In word2vec, which is predictive model for learning word embeddings, a distributed representation of a word is used. Take a vector with several hundred dimensions, each word is represented by a distribution of weights across those elements instead of a one-to-one mapping. In this context, each element in the vector contributes to the definition of many words. The relative similarity between two words vector representations can capture meaningful syntactic and semantic regularities. This can significantly contribute to the different NLP tasks like semantic analysis, (Synonym, Meronym, Hyponym) extraction, sentence tagging, question answering systems, documents classification, and so on tasks.Task descriptionThe aim of this work is to develop/adapt machine learning methods for identifying syntactic and semantic relations between words based on their vector representations. Basically, the evaluation of word embeddings performance for extracting (Synonym, Meronym, Hyponym, etc.) relations between words from large text corpus like Wikipedia. The written report must contain an introduction to the topic and provide an overview of related work. Furthermore, the designed and implemented methods must be described and discussed. The report can be written in either German or English.Requirements•\tGood programming skills in mind. A high level language like Java or functional language like R•\tHelpful: Previous experience in Natural Language Processing and Machine LearningBeginning and durationImmediately, duration 3-6 months (depending on the course)Keywords: NLP, Word Embeddings, Machine Learning, Deep LearningResearch Area(s): Knowledge & Educational TechnologiesContactWael Alkhatib , M.Sc. <Wael.Alkhatib@kom.tu-darmstadt.de >Fachgebiet Multimedia KommunikationBuilding S3|20 127",
                    "date": "Beitragvon wkht » 22. Jul 2016 16:46",
                    "user": "wkht"
                }
            ],
            "title": "Bachelor /Master thesis: Identification of meaningful syntactic and semantic relations between words in web documents ba",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34639&sid=761560cc62e3c239d97418da17f17765",
            "views": "167"
        },
        {
            "answers": "0",
            "date": "22. Jul 2016 16:44",
            "thread": [
                {
                    "body_html": "<div class=\"content\">Jul 19, 2016 – Master thesis, internal<br/><br/>Multi-label classification is the task of assigning a set of labels from a fixed vocabulary to a sample of data i.e. image, audio, text, etc. Multi-label text classification has been applied to a multitude of tasks, including document indexing, tag suggestion, and sentiment classification. Recently, many researches focused on integrating the semantic relations between labels to improve the state of the art performance of multi-label classification.  Researchers implemented algorithms to leverage the hierarchical relation between labels (taxonomic relations) to assign the different labels to a document, others tried to elaborate more by using the ontology (knowledge base) or statistical methods to label or cluster documents. In this thesis, we will extend the problem by considering the ontology of the terms and concepts in the document itself to represent the document in a new space that consider the semantic relations between different terms rather than considering only the labels dependency. <br/><br/><strong>Task description</strong><br/><br/>In this work, we will start with performing a comparative analysis of the existing methods for multi-label text classification, then investigating the possibility to improve the performance using labels dependency. Later on, we aim to develop/adapt machine learning methods to improve the multi-label text classification by considering ontology representation of documents terms and concepts.<br/><br/>The written report must contain an introduction to the topic and provide an overview of related work. Furthermore, the designed and implemented methods must be described and discussed.<br/><br/><strong>Requirements</strong><br/><br/>•\tGood programming skills in mind. A high level language like Java or functional language like R<br/>•\tHelpful: Previous experience in Natural Language Processing and Machine Learning<br/><br/><strong>Beginning and duration</strong><br/>Immediately, duration 3-6 months (depending on the course)<br/><br/><br/><strong>Keywords</strong>: NLP, Semantic Web, Machine Learning, Clustering<br/><br/><strong>Research Area(s)</strong>: Knowledge &amp; Educational Technologies<br/><br/><strong>Contact</strong><br/>Wael Alkhatib , M.Sc. &lt;Wael.Alkhatib@kom.tu-darmstadt.de &gt;<br/>Fachgebiet Multimedia Kommunikation<br/>Building S3|20 127</div>",
                    "body_text": "Jul 19, 2016 – Master thesis, internalMulti-label classification is the task of assigning a set of labels from a fixed vocabulary to a sample of data i.e. image, audio, text, etc. Multi-label text classification has been applied to a multitude of tasks, including document indexing, tag suggestion, and sentiment classification. Recently, many researches focused on integrating the semantic relations between labels to improve the state of the art performance of multi-label classification.  Researchers implemented algorithms to leverage the hierarchical relation between labels (taxonomic relations) to assign the different labels to a document, others tried to elaborate more by using the ontology (knowledge base) or statistical methods to label or cluster documents. In this thesis, we will extend the problem by considering the ontology of the terms and concepts in the document itself to represent the document in a new space that consider the semantic relations between different terms rather than considering only the labels dependency. Task descriptionIn this work, we will start with performing a comparative analysis of the existing methods for multi-label text classification, then investigating the possibility to improve the performance using labels dependency. Later on, we aim to develop/adapt machine learning methods to improve the multi-label text classification by considering ontology representation of documents terms and concepts.The written report must contain an introduction to the topic and provide an overview of related work. Furthermore, the designed and implemented methods must be described and discussed.Requirements•\tGood programming skills in mind. A high level language like Java or functional language like R•\tHelpful: Previous experience in Natural Language Processing and Machine LearningBeginning and durationImmediately, duration 3-6 months (depending on the course)Keywords: NLP, Semantic Web, Machine Learning, ClusteringResearch Area(s): Knowledge & Educational TechnologiesContactWael Alkhatib , M.Sc. <Wael.Alkhatib@kom.tu-darmstadt.de >Fachgebiet Multimedia KommunikationBuilding S3|20 127",
                    "date": "Beitragvon wkht » 22. Jul 2016 16:44",
                    "user": "wkht"
                }
            ],
            "title": "Master thesis: Ontology based multi-label text classification",
            "url": "https://www2.fachschaft.informatik.tu-darmstadt.de/forum/viewtopic.php?f=219&t=34638&sid=761560cc62e3c239d97418da17f17765",
            "views": "147"
        }
    ]
}